{
  "title": "Early Detection for Pancreatic Cancer",
  "url": "https://www.deeplearning.ai/the-batch/a-neural-network-shows-remarkable-accuracy-in-forecasting-risk-of-pancreatic-cancer/",
  "text": "A neural network detected early signs of pancreatic cancer more effectively than doctors who used the usual risk-assessment criteria.\nWhat’s new: Researchers at MIT and oncologists at Beth Israel Medical Center in Boston built a model that analyzed existing medical records to predict the risk that an individual will develop the most common form of pancreatic cancer. The model outperformed commonly used genetic tests. How it works: The authors trained PrismNN, a vanilla neural network, to predict a patient’s risk of receiving a diagnosis of pancreatic ductal adenocarcinoma (PDAC) in the next 6 to 18 months.\nThe authors assembled a dataset of roughly 26,250 patients who had developed PDAC and 1.25 million control patients from a proprietary database of anonymized health records from U.S. health care organizations provided by TriNetX (one of the study’s funders). All patients were 40 years or older.\nFor each patient, the dataset marked 87 features including age, history of conditions like diabetes and hypertension, presence of pancreatic cysts, and current medications.\nThe authors trained the model on their dataset to predict the probability of PDAC in the next 6 to 18 months. At inference, they classified patients as high-risk if the probability exceeded a certain threshold.\nResults: PrismNN identified as high-risk 35.9 percent of patients who went on to develop PDAC, with a false-positive rate of 4.7 percent. In comparison, the genetic criteria typically used to identify patients for pancreatic cancer screening flags 10 percent of patients who go on to develop PDAC. The model performed similarly across age, race, gender, and location, although some groups (particularly Asian and Native American patients) were underrepresented in its training data.\nBehind the news: AI shows promise in detecting various forms of cancer. In a randomized, controlled trial last year, a neural network recognized breast tumors in mammograms at a rate comparable to human radiologists. In 2022, an algorithm successfully identified tumors in lymph node biopsies.\nWhy it matters: Cancer of the pancreas is one of the deadliest. Only 11 percent of patients survive for 5 years after diagnosis. Most cases aren’t diagnosed until the disease has reached an advanced stage. Models that can spot early cases could boost the survival rate significantly.\nWe’re thinking: The fact that this study required no additional testing is remarkable and means the authors’ method could be deployed cheaply. However, the results were based on patients who had already been diagnosed with cancer. It remains for other teams to replicate them with patients who have not received a diagnosis, perhaps followed by a randomized, controlled clinical trial.\n\n\n",
  "image_filename": "a-neural-network-shows-remarkable-accuracy-in-forecasting-risk-of-pancreatic-cancer.png"
}