{
  "title": "A Victory for Innovation and Open Source",
  "url": "https://www.deeplearning.ai/the-batch/a-victory-for-innovation-and-open-source/",
  "text": "Dear friends,\nWe won! California’s anti-innovation bill SB 1047 was vetoed by Governor Newsom over the weekend. Open source came closer to taking a major blow than many people realize, and I’m grateful to the experts, engineers, and activists who worked hard to combat this bill.\nThe fight to protect open source is not yet over, and we have to continue our work to make sure regulations are based on science, not science-fiction.\nAs I  wrote previously, SB 1047 makes a fundamental mistake of trying to regulate technology rather than applications . It was also a very confusing law that would have been hard to comply with. That would have driven up costs without improving safety.\nWhile I’m glad that SB 1047 has been defeated, I wish it had never made it to the governor’s desk. It would not have made AI safer. In fact, many of its opponents were champions of responsible AI and making AI safe long before the rise of generative AI. Sadly, as the Santa Fe Institute’s Melanie Mitchell pointed out , the term “AI safety” has been co-opted to refer to a broad set of speculative risks that have little basis in science — as demonstrated by the security theater SB 1047 would have required — that don’t actually make anything safer. This leaves room for lobbying that can enrich a small number of people while making everyone else worse off.\nAs Newsom wrote to explain his decision, SB 1047 is “not informed by an empirical trajectory analysis of AI systems and capabilities.” In contrast, the United States federal government’s work is “informed by evidence-based approaches, to guard against demonstrable risks to public safety.” As the governor says, evidence-based regulation is important!\nMany people in the AI community were instrumental in defeating the bill. We're lucky to have Martin Casado, who organized significant community efforts; Clément Delangue, who championed openness; Yann LeCun, a powerful advocate for open research and open source; Chris Lengerich, who published deep legal analysis of the bill; Fei-Fei Li and Stanford's HAI, who connected with politicians; and Garry Tan, who organized the startup accelerator Y Combinator against the bill. Legendary investors Marc Andreessen and Roelof Botha were also influential. Plus far too many others to name here. I’m also delighted that brilliant artists like MC Hammer support the veto!\nLooking ahead, far more work remains to be done to realize AI’s benefits. Just this week, OpenAI released an exciting new voice API that opens numerous possibilities for beneficial applications! In addition, we should continue to mitigate current and potential harms. UC Berkeley computer scientist Dawn Song and collaborators recently published a roadmap to that end. This includes investing more to enable researchers to study AI risks and increasing transparency of AI models (for which open source and red teaming will be a big help).\nUnfortunately, some segments of society still have incentives to pass bad laws like SB 1047 and use science fiction narratives of dangerous AI superintelligence to advance their agendas. The more light we can shine on what AI really is and isn’t, the harder it will be for legislators to pass laws based on science fiction rather than science.\nKeep learning!\nAndrew\n\n\n",
  "image_filename": "a-victory-for-innovation-and-open-source.jpg"
}