{
  "title": "All the News That’s Fit to Learn",
  "url": "https://www.deeplearning.ai/the-batch/all-about-artifact-the-new-app-from-instagram-founders/",
  "text": "What does an entrepreneur do after co-founding one of the world’s top social networks? Apply the lessons learned to distributing hard news.\nWhat’s new: Kevin Systerom and Mike Krieger, who co-founded Instagram, launched Artifact , an app that uses reinforcement learning to recommend news articles according to users’ shifting interests.\nHow it works: The founders were inspired to launch a news app after witnessing TikTok’s success at designing a recommendation algorithm that learned from users’ habits, Systrom told The Verge . The app starts by classifying each user as a persona that has a standardized constellation of interests, the founders explained to the tech analysis site Stratechery . Then a transformer-based model selects news articles; its choices are continually fine-tuned via reinforcement learning, TechCrunch reported .\nThe model updates its recommendations based on factors that include how many users click through to an article, how much time they spend reading it, how often they share it externally, and how often they share it with friends within the app.\nThe system randomly selects some stories that are unconnected to a user’s past history to keep the feed from becoming too homogenous.\nHuman curators vet news sources, weeding out sources known to distribute disinformation, poor reporting, and clickbait. Users can add their own subscriptions manually.\nBehind the news: Artifact joins a crowded field of personalized news feeds from Google, Apple, Japan-based SmartNews and China-based Toutiao (owned by TikTok’s parent ByteDance). NewsBreak of California focuses on local news.\nYes, but: Delivering news is a tough business. Never mind the precipitous decline of traditional newspapers. SmartNews announced it was laying off 40 percent of its staff. Why it matters: Social media sites like Facebook grew partly on their promises to deliver timely news according to individual users’ interests, but they struggle to deliver high-quality news. A 2019 Pew Research Center poll found that 55 percent of U.S. adults thought social media companies’ role in curating consumption resulted in a worse mix of news. Artifact aims to apply machine learning techniques developed to help people stay in touch with friends to keep them informed in a rapidly changing world. We’re thinking: Social media networks have used recommendation algorithms to maximize engagement, enabling clickbait and other low-quality information to flourish. Artifact’s choice of what to maximize, be it user engagement (which, in ad-driven social networks, correlates with revenue), metrics that track consumption of high-quality news, or something else, will have a huge impact on its future.\n\n\n",
  "image_filename": "all-about-artifact-the-new-app-from-instagram-founders.jpg"
}