{
  "title": "Aping Joe Rogan",
  "url": "https://www.deeplearning.ai/the-batch/aping-joe-rogan/",
  "text": "The tide of AI-driven fakery rose higher around the Internet’s ankles as the synthesized voice of comedian/podcaster Joe Rogan announced his purported formation of a hockey team made up of chimpanzees.\nWhat happened: Dessa, an AI company based in Toronto, released a recording of its RealTalk technology imitating Rogan. The digital voice, bearing an uncomfortably close resemblance to the real deal, describes the podcaster’s supposed all-simian sports team. Then it tears through tongue twisters before confessing the faux Rogan’s suspicion that he’s living in a simulation.\nBehind the news: Researchers have been converging on spoken-word fakes for some time with impressive but generally low-fidelity results . One joker mocked up a classic Eminem rap in the simulated voice of psychologist and culture warrior Jordan Peterson . Dessa employees Hashiam Kadhim, Joe Palermo, and Rayhane Mama cooked up the Rogan demo as an independent project.\nHow it works: No one outside the company knows. Dessa worries that the technology could be misused, so it hasn’t yet released the model. It says it will provide details in due course.\nWhy it matters: Simulations of familiar voices could enable new classes of communication tools and empower people who have lost their own voices to disease or injury. On the other hand, they could give malefactors more effective ways to manipulate people on a grand scale. This fake conversation between President Trump and Bernie Sanders is a playful harbinger of what may lie in store.\nYes, but: Dessa’s Rogan impersonation is remarkably true to life, but the rhythm and intonation give it away. The company offers a simple test to find out whether you can distinguish between real and synthesized Rogan voices. Our take: Deepfakery has legitimate and exciting applications in entertainment, education, and other fields. Yet there's good reason for concern that it could mislead people and create havoc. Some day, it will be so good that no person or AI can recognize it. Brace yourself.\n\n\n",
  "image_filename": "aping-joe-rogan.png"
}