{
  "title": "Drive Different",
  "url": "https://www.deeplearning.ai/the-batch/apple-plans-self-driving-car-release-for-2026/",
  "text": "Apple is redrawing the road map for its self-driving car.\nWhat's new: The company is redesigning an autonomous car that has been in development for nearly a decade, Bloomberg reported . Originally intended to be fully autonomous under all conditions, the redesigned vehicle will allow for a human driver.\nDownshift: Apple had scheduled the vehicle, code named Titan, for 2025, anonymous insiders said. However, executives realized earlier this year that they couldn’t meet the deadline and decided to scale back the autonomous features. The new timeline calls for a prototype by 2024, testing through 2025, and launch in 2026. The target price is under $100,000, a markdown from the original $120,000. The company is currently testing its semi-autonomous system on Lexus SUVs in several U.S. states.\nThe original design called for an interior in which all the seats faced the center, without a steering wheel or pedals. The new design will include human controls.\nThe revamped car will drive autonomously only on highways, allowing drivers to watch movies and play video games. It will alert them when manual control is required to negotiate surface streets or bad weather.\nThe self-driving system navigates using data from lidar, radar, and cameras. An onboard processor nicknamed Denali executes some tasks while Amazon Web Services handles others in the cloud.\nRemote operators may take over control of vehicles during emergencies.\nBehind the news: Fully self-driving cars on the open road remain limited to a few robotaxi deployments in China and the United States . Meanwhile, the industry has suffered a series of setbacks. Ford shut down Argo, its joint project with Volkswagen. Tesla’s purported Full Self-Driving option requires a human in the loop. Further development is required to enable such vehicles to drive safely despite challenges like road construction and snow .\nWhy it matters: Commercializing fully autonomous vehicles is a tantalizing but elusive goal. Apple’s decision to downshift for the sake of bringing a product to market suggests that human drivers will sit behind the wheel for the foreseeable future.\nWe're thinking: Full self-driving cars have been five years away for the past decade. The challenge of handling the long tail of rare but critical events has been a persistent issue. Upcoming developments such as foundation models for computer vision are likely to make a substantial difference. We don't know when, but we're confident that the future includes full autonomy.\n\n\n",
  "image_filename": "apple-plans-self-driving-car-release-for-2026.gif"
}