{
  "title": "Art team sells robot’s painting for $1.1 million",
  "url": "https://www.deeplearning.ai/the-batch/art-team-sells-robots-painting-for-1-1-million/",
  "text": "Twice a week, Data Points brings you the latest AI news, tools, models, and research in brief. In today’s edition, you’ll find:\nFrontierMath’s hard math problems baffle models\nNvidia partners with Hugging Face’s robotics platform\nMistral offers multilingual text moderation\nGrok teases free access for New Zealand’s X users\nBut first:\nRobot artist’s Turing portrait fetches surprising sum at auction\nA painting of mathematician Alan Turing created by the AI-powered robot Ai-Da sold at Sotheby’s for $1.1 million, far exceeding initial estimates. The humanoid robot, created by artist Aidan Meller and a team of nearly 30 people, used AI algorithms to interpret photos of Turing and produce multiple paintings that were then combined into a final portrait. Ai-Da’s sale shows the growing interest and value placed on AI-generated art, even as it raises questions about creativity, authorship, and the role of technology in artistic production. ( The New York Times and Ai-Da )\nU.S. restricts TSMC’s chip shipments to China\nThe U.S. government ordered Taiwan Semiconductor Manufacturing Co (TSMC) to halt shipments of advanced chips to Chinese customers, particularly those used in artificial intelligence applications. The Department of Commerce imposed export restrictions on sophisticated chips with 7 nanometer or smaller designs destined for China, affecting AI accelerators and graphics processing units. This move follows the discovery of a TSMC chip in a Huawei AI processor, which potentially violated existing export controls and raised concerns about the diversion of advanced chips to restricted Chinese companies. ( Reuters )\nNew advanced math problems stump top AI models\nResearchers at Epoch AI introduced FrontierMath, a benchmark of hundreds of original, expert-crafted mathematics problems designed to evaluate advanced reasoning capabilities in AI systems. The problems span major branches of modern mathematics and typically require hours or days for expert mathematicians to solve. Current leading models, including Claude 3.5 Sonnet and GPT-4, solved less than 2 percent of FrontierMath problems, revealing a significant gap between current AI capabilities and human mathematical expertise. ( Epoch AI )\nHugging Face and Nvidia join forces to boost robotics research\nHugging Face and Nvidia announced a collaboration at the Conference for Robot Learning to accelerate robotics research by combining their open-source platforms and technologies. The partnership will integrate Hugging Face’s LeRobot platform with NVIDIA’s AI, Omniverse, and Isaac robotics technology to enable researchers and developers to solve problems in robotics across multiple industries. This collaboration aims to create a shared ecosystem where robotics researchers can more easily access and build upon each other’s work. ( Nvidia )\nMistral AI launches content moderation API\nMistral AI released a new multilingual content moderation API to help developers implement safety guardrails in AI applications. The API, which powers moderation in Mistral’s Le Chat, can classify text and conversation inputs into 9 categories including sexual content, hate speech, violence, and personally identifiable information. This release could help industries seeking to use language models to make content moderation more scalable and robust, whether in chatbot applications or elsewhere. ( Mistral AI )\nX tests free access to Grok\nSocial network X began testing free access to its AI chatbot Grok for users in New Zealand, potentially expanding beyond its current limitation to premium subscribers. The free version reportedly has usage limits, including 10 to 20 queries for every two hours depending on the model, and requires users to have accounts that are at least a week old and include linked phone numbers. This move could help xAI, Grok’s developer, gather more user feedback and improve its competitive position against other AI models like ChatGPT, Claude, and Gemini. ( TechCrunch )\nStill want to know more about what matters in AI right now?\nRead last week’s issue of The Batch for in-depth analysis of news and research.\nLast week, Andrew Ng reflected on the role of social media manipulation in recent elections, emphasizing that generative AI likely wasn’t the primary tool used to spread disinformation.\n“The problem here is not that AI is too powerful; rather, it is that AI is not powerful enough. Specifically, the issue is not that generative AI is so powerful that hostile foreign powers or unethical political operatives are successfully using it to create fake media that influences us; the problem is that some social media companies’ AI algorithms are not powerful enough to screen out fake engagement by software bots, and mistake it for real engagement by users.”\nRead Andrew’s full letter here .\nOther top AI news and research stories we covered in depth: Anthropic empowers Claude Sonnet 3.5 to operate desktop apps, with safety and security warnings; automation transforms U.S. shipping ports , heightening labor tensions as robots take on more tasks on the loading docks; a new study, COMPL-AI, assesses large language models’ compliance with the EU’s AI Act; and OpenAI’s MLE-bench introduces a new way to test AI coding agents by having them train algorithms.\nSubscribe to Data Points\n\n\n",
  "image_filename": "art-team-sells-robots-painting-for-1-1-million.jpg"
}