{
  "title": "Artistry Is Obsolete",
  "url": "https://www.deeplearning.ai/the-batch/artistry-is-obsolete/",
  "text": "Is human creativity being replaced by the synthetic equivalent? The fear: AI is cranking out increasingly sophisticated visual, musical, and literary works. AI-generated media will flood the market, squeezing out human artists and depriving the world of their creativity. Horror stories: The most compelling AI-generated art today requires people who curate a system’s inputs and outputs to ensure that automated creations have a recognizable aesthetic character. Tomorrow is up for grabs.\nMusic is increasingly automated. At the frontier, there’s the singing, composing, marimba-playing robot Shimon ; the computer-assisted completion of Beethoven's unfinished Tenth Symphony ; and OpenAI’s Jukebox , which synthesizes alternate-reality hits by everyone from Elvis Presley to Rage Against the Machine.\nAI is transforming words into images. In a typical setup, CLIP, a model that matches text with images, receives a text description and directs a generative adversarial network (GAN) to produce an image that fits. Digital artist Martin O’Leary used this technique to turn Samuel Taylor Coleridge’s epic poem “Kubla Khan” into a scrolling montage .\nMultimedia artist Ross Goodwin loaded a laptop with an LSTM trained to convert images to words, attached it to camera output, and instructed it to compose prose while he drove across the country. The resulting novel, called 1 The Road , garnered acclaim .\nThe end of art history? AI-generated art has edged its way into both fine-art and commercial worlds.\nIn 2018, a GAN-produced portrait sold at auction for $432,500.\nCompanies like Soundraw enable video producers, YouTube creators, and Spotify artists to generate custom music from a web page.\nBrooksby.ai sells novels written by a recurrent neural network that was fine-tuned on the Project Gutenberg database of classic books. A GAN produces the covers, and a regression model trained on data from Amazon.com prices them.\nFacing the fear: AI makes a wonderful complement to human creativity, producing variations, offering alternatives, or supplying a starting point for traditional artistic exploration. On the other hand, the best current models can produce output that, to an untrained eye or ear, comes close to human artworks. And they’re only going to get better.\n\n\n",
  "image_filename": "artistry-is-obsolete.jpg"
}