{
  "title": "Panopticon Down Under",
  "url": "https://www.deeplearning.ai/the-batch/australian-prisons-adopt-face-recognition/",
  "text": "A state in Australia plans to outfit prisons with face recognition.\nWhat’s new: Corrective Services NSW, the government agency that operates nearly every prison in New South Wales, contracted the U.S.-based IT firm Unisys to replace a previous system, which required a fingerprint scan to identify people, with one that requires only that subjects pass before a camera, InnovationAus.com reported . How it works: The new system will use face recognition to identify inmates and visitors as they enter or exit correctional facilities.\nNeither Corrective Services NSW nor Unisys disclosed details on the technology. Unisys offers a system called Stealth(identity) that scans a person’s face, irises, voice, and fingerprints. It places faces of people it has identified in a registry. Then, when it encounters any face, it scans the registry for a match.\nThe new system scans faces and irises simultaneously and does not require fingerprinting. It will process individuals faster and improve categorization of people coming and going, according to a prison representative.\n16 correctional centers will complete installation in early 2023 at a total cost of $12.8 million in Australian dollars. Corrective Services NSW said it expects the system to reduce operational expenses by 12 percent.\nYes, but: Samantha Floreani of Digital Rights Watch raised concerns that face recognition may exacerbate biases in the Australian corrective system, which incarcerates indigenous people disproportionately. Additionally, Floreani said that contracting to Unisys, a U.S.-based firm, raises questions about whether personal data on Australians will be transferred to another country and whether the data will be secure and handled properly. The Australian public, too, is wary. A 2021 poll found that 55 percent of Australians supported a moratorium on face recognition until stronger safeguards are in place. Behind the news: England and Wales tested face recognition for screening prison visitors in 2019, mostly in an effort to crack down on smuggling of drugs into prisons. In the United States, the federal Justice Department has funded several initiatives to apply face recognition. The U.S. Marshals Service, which handles fugitive investigations, is developing a face recognition system to aid in transporting prisoners.\nWhy it matters: The flow of visitors, contractors, and prisoners into and out of correctional facilities creates opportunities for security breaches. Face recognition promises to help manage this traffic more safely. However, the technology, which is relatively new, largely unregulated, and developing rapidly, brings with it potential for abuse, mission creep, and other adverse consequences, especially in a high-stakes field like criminal justice. We’re thinking: Surveillance has always been an inextricable part of incarceration, but it shouldn’t encroach on the rights of prisoners or the people who guard, visit, and provide services to them. More optimistically, if technology can generate indelible, auditable records of the activities of both guards and prisoners, it can help protect against abuses and address them when they occur.\n\n\n",
  "image_filename": "australian-prisons-adopt-face-recognition.png"
}