{
  "title": "AI Busts Out at CES",
  "url": "https://www.deeplearning.ai/the-batch/ces-2024-showcased-ais-reach-beyond-browsers-and-smartphones/",
  "text": "The 2024 Consumer Electronics Show in Las Vegas showcased products that take advantage of increasingly powerful, increasingly accessible AI capabilities.\nWhat’s new: Many debuts at the massive CES show showed that large language models (LLMs) are moving beyond browsers and smartphones.\nBest of show: The show’s surprise hit was a portable personal assistant. LLM-powered automobile dashboards and an AI accelerator card also stood out.\nRabbit’s R1 ($199, cellular service required) is among a new wave of AI-optimized hardware devices, including the Humane AI Pin , TranscribeGlass voice transcription display, and Timekettle language translators, that seek to usurp smartphone capabilities. The R1 accepts voice commands to play music, call a car, order food, reserve flights, and the like by interacting with services like Spotify and Uber. The hand-held unit houses a touchscreen, camera, wheel-and-button controller, and cellular modem. It uses a proprietary “large action model” based on attention and graph neural networks; the model learns by mimicking how people use web interfaces and runs in the cloud to translate voice commands into actions via a web portal. The R1 will be available in March and has already sold out through June. A future update will enable users to teach the device new skills, like editing images or playing video games, by demonstrating them in view of the camera.\nVolkswagen and Mercedes Benz demonstrated dashboard voice assistants equipped with large language models. Along with the usual navigation and entertainment, the new consoles deliver personalized information like nearby service stations or restaurants. Powered by OpenAI and automotive AI developer Cerence, Volkswagen’s system will be standard in most vehicles beginning in the spring. Mercedes’ MB.OS will be available next year.\nTaiwanese startup Neuchips displayed an add-in board that enables desktop computers to run large language models like the 7 billion-parameter version of Llama 2. The Evo PCIe AI accelerator is optimized for transformer networks to provide comparable performance to GPUs while consuming less electricity (55 watts versus an Nvidia RTX 4080’s 320 watts). The card will be available later this year at an undisclosed price. Versions outfitted with four or more chips are on the company’s roadmap.\nWhy it matters: Flashy CES demos often mask underdeveloped products and vaporware. But this year, AI for processing voice, text, and images is mature enough to enable product designers to focus on everyday use cases and intuitive user experiences. While some of this year’s AI-powered debuts seemed like overkill — for instance, the computer vision-equipped Flappie cat door that won’t open while your pet has a mouse in its jaws — others suggest that startups and giants alike are rethinking the technology’s capacity to simplify and enhance daily life and work.\nWe’re thinking: Not long ago, simply connecting a home appliance to the internet earned the designation “smart.” Increasingly, AI is making that label credible.\n\n\n",
  "image_filename": "ces-2024-showcased-ais-reach-beyond-browsers-and-smartphones.gif"
}