{
  "title": "China Restricts Face Recognition",
  "url": "https://www.deeplearning.ai/the-batch/chinas-internet-watchdog-unveiled-draft-rules-on-face-recognition/",
  "text": "China’s internet watchdog proposed sweeping limitations on face recognition — with significant exceptions.\nWhat’s new: The Cyberspace Administration of China unveiled draft rules that restrict the use of face recognition systems, with explicit carve-outs when national security or public or personal safety is at stake. The public can submit feedback before September 7.\nNarrow limits, broad exceptions: The proposal, which will affect mainland China but not Macau or Hong Kong, applies to both public and private users of face recognition. It follows recent restrictions on generative AI and collecting personal data .\nFace recognition can’t be used to analyze race, ethnicity, religion, health status, or social class except to protect national security or public or personal safety.\nIt can’t be used to identify people in public places at a distance except to protect national security or public or personal safety.\nFace recognition is allowed for verifying identity only if other methods aren't available.\nIt isn’t allowed in locations where it may infringe on personal privacy, such as hotel rooms or toilets.\nUsers can’t coerce or mislead the public into providing face data with excuses such as “improving service quality.”\nInstitutions that use face recognition in public locations or store images of more than 10,000 faces must register their use and data-handling procedure with the government.\nBefore gathering face data, users must obtain the subject’s permission, or a parent’s or guardian’s if the subject is less than 14 years old.\nBehind the news: China leads the world in developing and deploying face recognition. Authorities use it widely in law enforcement, while businesses use it for authenticating payments, checking the identities of air and rail passengers, and granting access to residential buildings. Nonetheless, many Chinese residents have voiced their unease with the technology.\nIn 2021, a Chinese appeals court ruled in favor of a law professor who sued a Hangzhou zoo. The plaintiff claimed that the zoo’s use of face recognition to verify its visitors’ identities was unnecessary.\n74 percent of Chinese residents surveyed favored alternatives to face recognition for verifying identity, according to a 2019 survey conducted by Beijing’s Nandu Personal Information Protection Research Centre. 80 percent of respondents were concerned about data security, and 84 percent wanted the option to review face-recognition data that represented them.\nYes, but: The exemptions for national security and safety give China’s government authority to continue using the technology for potentially controversial applications.\nWhy it matters: Face recognition is a double-edged sword. It has legitimate uses for security and law enforcement, but it can also be misused to violate privacy. Such concerns motivated European Union lawmakers to insert a prohibition on face recognition in public spaces into the current draft of the union’s AI Act, which is in the final stage of revision. China’s new rules bring that country’s face recognition policy closer into line with that standard — the exceptions for national security and public safety notwithstanding. We’re thinking: It’s interesting to see China take the lead in regulating face recognition, where it dominates the technology and market. We support stronger protections for personal privacy.\n\n\n",
  "image_filename": "chinas-internet-watchdog-unveiled-draft-rules-on-face-recognition.png"
}