{
  "title": "Cloning dead celebrities’ voices",
  "url": "https://www.deeplearning.ai/the-batch/cloning-dead-celebrities-voices/",
  "text": "Twice a week, Data Points brings you the latest AI news, tools, models, and research in brief. Today’s edition includes:\nElevenLabs gains rights to use dead celebrities’ voices for narration\nVALL-E 2, Microsoft’s speech cloning tool\nLangChain introduces LangGraph Cloud\nYouTube updates privacy policy to cover deepfake removal\nBut first:\nElevenLabs gains rights to use dead celebrities’ voices to narrate books and articles ElevenLabs secured agreements with the estates of Judy Garland, James Dean, Burt Reynolds, and Laurence Olivier to clone their voices to use in its text-to-speech Reader App. Digital text narrated by these celebrity voices will soon be available to users. Cloning dead celebrities’ audio and video likenesses remains controversial, and California's proposed Assembly Bill 1836 would make it mandatory for companies like ElevenLabs to obtain estates’ consent for such partnerships. ( ElevenLabs )\nMicrosoft’s speech cloning model might be too good to be trusted Microsoft developed VALL-E 2, an AI system that can replicate human voices with remarkable fidelity after hearing just a brief audio sample. The system outperforms previous voice cloning technologies in creating natural-sounding speech closely matching the original speaker's voice, even for difficult phrases. Despite its impressive capabilities, Microsoft stresses that VALL-E 2 is currently only a research project, and will not release the model to the public, citing ethical concerns about potential abuses of voice impersonation. ( Microsoft )\nAmazon hires away Adept executives and much of its team, including CEO David Luan Luan will lead a new “AGI Autonomy” team at Amazon, reporting to Rohit Prasad, who heads the company's Artificial General Intelligence initiatives. Amazon also licensed some of Adept's technology, which aims to automate enterprise workflows; it's unclear what Amazon paid for the non-exclusive agreement. This move mirrors Microsoft's recent hiring of Inflection AI's co-founder and other employees, highlighting fierce competition among tech giants to acquire top AI talent and technology. ( GeekWire )\nNew optimizer reduces memory usage while maintaining performance Researchers at the Chinese University of Hong Kong and other institutions developed Adam-mini, a new machine learning optimizer that achieves comparable or better performance than AdamW while using 45% to 50% less memory. A machine learning optimizer adjusts the parameters of a model during training to minimize errors and improve the model’s performance; Adam-mini does this by strategically partitioning parameters and assigning efficient learning rates to each block. This innovation could significantly benefit AI researchers working with large language models, as it allows for faster training times and enables those with limited GPU resources to work on more ambitious projects. ( arXiv )\nLangChain releases LangGraph v0.1 and introduces LangGraph Cloud LangChain launched a stable release of LangGraph v0.1, a framework for building agentic and multi-agent applications with greater precision and control. The company also announced LangGraph Cloud, a beta infrastructure for deploying LangGraph agents at scale with integrated monitoring and development tools. These releases promise to help developers create more robust AI systems by offering flexible APIs, custom cognitive architectures, and features like human-in-the-loop collaboration and streaming capabilities. ( LangChain )\nYouTube makes it easier to remove deepfakes YouTube quietly updated its privacy request process to allow individuals to request the removal of AI-generated or synthetic content that simulates their face or voice. The company will evaluate takedown requests based on multiple factors, including disclosure of AI use, uniqueness of identification, public interest value, and whether the content involves public figures or sensitive behavior. This policy change reflects YouTube’s efforts to balance the rise of AI-generated content with privacy concerns, particularly as the platform grapples with potential misuse in election years. ( TechCrunch )\nSubscribe to Data Points here\nStill want to know more about what matters in AI right now?\nRead the landmark 256th issue of The Batch for in-depth analysis of news and research.\nThis week, Andrew Ng discussed the importance of quality in education and putting learners first:\n“We don’t always get it right, but we scrutinize learner feedback (one of my most important weekly routines is to study a dashboard that summarizes learner ratings of our courses) and work to make sure our courses serve learners well. And yes, we have a large-language model powered application that reads learner reviews to flag important issues quickly.”\nRead Andrew's full letter here .\nOther top AI news and research stories we covered in depth included: OpenAI to block China and other countries from using its services, Hugging Face revamps its open LLM leaderboard , the world’s largest music companies sue Suno and Udio , and a research team in Japan developed an automated system for model merging .\n\n\n",
  "image_filename": "cloning-dead-celebrities-voices.jpg"
}