{
  "title": "Computer Vision for Human Vision",
  "url": "https://www.deeplearning.ai/the-batch/computer-vision-for-human-vision/",
  "text": "AI is poised to revolutionize diagnosis of eye disease. What’s new: Articles are piling up in scientific journals heralding computer vision’s success in detecting conditions such as diabetic retinopathy, a common condition that can cause blindness if it’s not treated in time:\nIn a study of 1,574 diabetes patients in Zambia, a neural net diagnosed the condition with accuracy better than 97%.\nResearcher Yannis Paulus found that software running on a smartphone with a retinal scanner compared favorably to examination by a specialist in a clinic.\nTwo recent articles in Nature heralded AI’s potential in diabetic retinopathy and other eye diseases.\nDeepMind and IBM lately have touted their progress in detecting these maladies.\nWhy it matters: Roughly 400 million people suffer from diabetes worldwide, and 10% of them will develop a serious case of retinopathy. Doctors can treat it if they can detect it in time, but there aren’t enough ophthalmologists or clinics to go around. AI running on portable devices could spot cases locally, catching the condition early and conserving specialist attention for severe cases. Behind the news: The Food and Drug Administration approved its first AI-driven eye scanner for clinical use last year under a fast-track program for novel technologies. What they’re saying: “Advances in the automated diagnosis of eye conditions . . . have put artificial intelligence in a position to transform eye care. Soon, AI-based systems could augment physicians’ decision-making in the clinic — or even replace physicians altogether.” — Aaron Lee, Dept. of Ophthalmology, University of Washington, in Nature Bottom line: Many experts expect AI’s march on medicine to start in the radiology lab. But you’re likely to find it in the ophthalmologist’s office even sooner.\n\n\n",
  "image_filename": "computer-vision-for-human-vision.png"
}