{
  "title": "No More GPUs",
  "url": "https://www.deeplearning.ai/the-batch/confronting-the-fear-of-a-global-chip-shortage-in-2022/",
  "text": "Advanced AI requires advanced hardware. What if the global supply of high-end AI chips dries up?\nThe fear: Most of the world’s advanced AI processors are manufactured in Taiwan, where tension with mainland China is rising. Nearly all such chips are designed in the U.S., which has blocked China from obtaining them. That could prompt China to cut off U.S. access to Taiwan’s manufacturing capacity. Military action would be a human tragedy. It would also imperil progress in AI.\nHorror stories: China and the U.S. are on a collision course that threatens the global supply of advanced chips.\nIn October, the U.S. government announced sweeping rules that bar U.S. companies from selling high-performance chips and chip-making equipment to China. The restrictions also prevent non-U.S. chip makers that use U.S. software or equipment from selling to or working with China. China’s AI efforts rely primarily on chips designed by Nvidia, a U.S. company.\nEven if tensions relax, other obstacles may impede the flow of advanced chips. Ongoing anti-Covid lockdowns could disrupt chip supplies, as could drought in Taiwan and floods in Malaysia.\nSecuring the supply: Both the U.S. and China are trying to produce their own supplies of advanced chips. But fabricating circuitry measured in single-digit nanometers is enormously difficult and expensive, and there’s no guarantee that any particular party will accomplish it.\nChina is executing a 2014 plan to achieve dominance in semiconductors. It’s cultivating a domestic semiconductor industry, though the U.S. sanctions on chip-design and -manufacturing equipment explicitly threaten that project.\nIn August, the U.S. government passed the CHIPS and Science Act. This law aims to boost U.S. semiconductor supplies by giving U.S. manufacturers tax incentives to build factories in the U.S. and funding research and development.\nIntel, which manufactures chips but has fallen behind in advanced fabrication technology, recently broke ground on a $20 billion pair of plants in central Ohio.\nForeign makers of cutting-edge chips are moving to the U.S. Taiwan Semiconductor Manufacturing Company, which produces most of the world’s most advanced chips, is building a new $12 billion plant in Arizona, slated to start production in 2024. Samsung, which also boasts advanced fabrication capabilities, plans a $17 billion factory in Texas.\nFacing the fear: If a chipocalypse does occur, the AI community will need to become adept at workarounds that take advantage of older semiconductor technology, such as small data, data-centric AI development, and high-efficiency model architectures. It will also need to push for international cooperation amid intensifying polarization. Still, a chip shortage would be the least scary thing about a great-power conflict.\n\n\n",
  "image_filename": "confronting-the-fear-of-a-global-chip-shortage-in-2022.jpg"
}