{
  "title": "Coping With Covid",
  "url": "https://www.deeplearning.ai/the-batch/coping-with-covid/",
  "text": "AI accelerated the search for a coronavirus vaccine, detected Covid-19 cases, and otherwise softened the pandemic’s blow. What happened: Machine learning researchers worldwide scrambled to harness the technology against the coronavirus. Among many misfires, they racked up important successes in detection, inoculation, other areas. Driving the story: The pandemic began with high hopes for AI-driven solutions among researchers and officials . But an April metastudy sounded a cautious note, finding that 145 models surveyed were poorly documented, yielded overly optimistic results, and were likely to be biased. Researchers persisted, ultimately delivering vaccines in record time. Outside the lab, deep learning teams tried to keep people safer and more connected.\nBlueDot, which analyzes news reports for significant events, detected the nascent pandemic several days ahead of the global health monitors and sent an early warning to its customers.\nThe cities of Paris and Cannes evaluated compliance with masking regulations using computer vision in transit stations, buses, and markets. The government of Togo trained a model to identify regions of extreme poverty in satellite imagery. It used the output to guide distribution of relief funds to those most in need.\nChatbots provided the locked-down and lonely with synthetic friends to chat and flirt with. For people working from home, videoconferencing companies trained models to filter background noises and virtually transform pajamas into business attire .\nA collaboration among many institutions in China developed a model that detects Covid-19 in CT scans with better than 90 percent accuracy. The model has been deployed in seven countries and the code has been downloaded 3 million times so far.\nModerna, a U.S. biotech company whose vaccine was approved by the U.S. Food and Drug Administration in December, used machine learning to optimize mRNA sequences for conversion into molecules that could be tested.\nBehind the news: AI may yet play an important role in treating Covid-19. The nonprofit Covid Moonshot project used a semisupervised deep learning platform to filter 14,000 candidate antiviral drugs. The system validated four compounds that are expected to advance to animal trials. Where things stand: AI is no silver bullet, but the advent of this new, virulent, highly infectious strain of coronavirus has been a bracing test run of its capabilities to fight infectious diseases — and helped us live with them, too.\nLearn more: The Batch featured regular AI-Against-Covid news reports starting in April .\n\n\n",
  "image_filename": "coping-with-covid.jpg"
}