{
  "title": "Corporate Ethics Counterbalance",
  "url": "https://www.deeplearning.ai/the-batch/corporate-ethics-counterbalance/",
  "text": "One year after her acrimonious exit from Google, ethics researcher Timnit Gebru launched an independent institute to study neglected issues in AI. What’s new: The Distributed Artificial Intelligence Research Institute (DAIR) is devoted to countering the influence of large tech companies on the research, development, and deployment of AI. The organization is funded by $3 million in grants from the Ford Foundation, MacArthur Foundation, Kapor Center, and Open Society Foundation. How it works: DAIR is founded upon Gebru’s belief that large tech companies, with their focus on generating profit, lack the incentive to assess technology’s harms and the motivation to address them. It will present its first project this week at NeurIPS .\nRaesetje Sefala of Wits University in Johannesburg led a team to develop a geographic dataset of South African neighborhoods. It combines geographic coordinates of building footprints, household income, and over 6000 high-resolution satellite photos taken between 2006 and 2017.\nThe team trained semantic segmentation models to outline neighborhoods, gauge their growth over time, and classify them as wealthy, nonwealthy, nonresidential, or vacant.\nThe initial results show how policies enacted during apartheid have segregated wealthy communities from poor townships, which are often side by side.\nBehind the news: Gebru was the co-lead of Google’s Ethical AI group until December 2020. The company ousted her after she refused to retract or alter a paper that criticized its BERT language model. A few months later, it fired her counterpart and established a new Responsible AI Research and Engineering group to oversee various initiatives including Ethical AI. Why it matters: AI has the potential to remake nearly every industry as well as governments and social institutions, and the AI community broadly agrees on the need for ethical principles to guide the process. Yet the companies at the center of most research, development, and deployment have priorities that may overwhelm or sidetrack ethical considerations. Independent organizations like DAIR can call attention to the ways in which AI may harm some groups and use the technology to shed light on problems that may be overlooked by large, mainstream institutions. We’re thinking: Gebru has uncovered important issues in AI and driven the community toward solutions. We support her ongoing effort to promote ethics in technology.\n\n\n",
  "image_filename": "corporate-ethics-counterbalance.gif"
}