{
  "title": "The latest in AI from Feb. 29 to Mar. 6, 2024",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-239/",
  "text": "This week's top AI news and research stories featured Mistral's new LLMs, a robot chemist, Google's open source LLMs, and a way to make LLMs better at math. But first:\nAnthropic’s Claude 3 model family shines on metrics The largest of the new models, called Opus, outperforms GPT-4 on language reasoning and rivals Gemini 1.0 on visual reasoning tasks. All three of the models (Haiku and Sonnet) have a accept inputs up to 200k tokens by default, but have been tested at up to 1M tokens, available in special cases. All three are also more accurate and less likely to refuse prompts that bump up against the system’s guardrails. (See more at Claude )\nElon Musk sues OpenAI for breach of contract Musk, who cofounded OpenAI before acrimoniously leaving the company in 2018, argues that the company violated its founding agreement by seeking to develop AGI for profit. OpenAI’s executives in turn argue that Musk wanted to convert OpenAI into a commercial entity in partnership with his own company, Tesla. Musk’s suit relies on informal email communications that legal experts say are unlikely to constitute a binding contract. (Read the story at Reuters )\nUK government experiments with AI to streamline ministerial workloads The 'red box' tools, referencing the traditional ministerial work cases, will automate the drafting process for answering parliamentary questions while ensuring human oversight and source citation for verification. A tool to process public consultation responses is also being trialed. The government also plans an AI collaboration charter with the NHS to explore further applications in healthcare, including diagnostics and prescription management. (Read more at Financial Times )\nCalifornia pauses Waymo's robotaxi expansion plans Waymo's ambitions to broaden its robotaxi service into Los Angeles and San Mateo counties encountered a roadblock.The California Public Utilities Commission (CPUC) suspended the application for 120 days due to the need for additional staff review. The CPUC describes the suspension as a routine part of their review process, though local officials have expressed concerns about public safety based on robotaxi experiences in San Francisco. (Read the news at TechCrunch )\nMerging ChatGPT with robotics sparks concerns Scientists are integrating the capabilities of ChatGPT into robots, aiming to transcend traditional robotics limitations and introduce flexibility and adaptability in tasks ranging from industrial patrols to culinary preparations. But this integration is not without its challenges and ethical dilemmas. The practical difficulties of programming robots to handle the unpredictability of real-world scenarios are compounded by concerns over AI's reliability, potential for bias, and privacy issues. (Read the full report at Scientific American )\nMicrosoft launches Copilot for Finance Joining Copilot for Sales and Copilot for Service, Copilot for Finance automates workflows, provides insights, and facilitates decision-making processes in finance departments. The tool aims to alleviate the burden of data entry and review cycles that currently consume 62 percent of finance professionals' time. It integrates with existing financial data sources and ERP systems like Microsoft Dynamics 365 and SAP, offering features such as variance analysis, reconciliation processes, and generating presentation-ready visuals and reports. (Read Microsoft’s blog )\nOpenAI and robot-maker Figure forge partnership The collaboration is bolstered by $675 million in venture capital funding from a consortium of investors, including Amazon founder Jeff Bezos, and the investment arms of Intel and OpenAI itself. Figure, a relatively new player in the tech scene with ambitious plans but no commercial product yet, has captured the attention and support of tech industry heavyweights with its vision of deploying billions of human-like robots in both workplaces and homes globally. (Read the article at AP News )\nLaurie Anderson creates chatbot that mimics the style of late husband Lou Reed The project, part of Anderson's \"I’ll Be Your Mirror\" exhibition, draws on Reed's extensive body of work to generate text responses that reflect his unique voice. Collaborating with the University of Adelaide’s Australian Institute for Machine Learning, Anderson embraced this technology as a tool for artistic exploration and expression. (Read the details at The Guardian )\nUK and France announce AI collaboration initiatives The partnership includes £800,000 in joint funding to enhance UK-French research projects and a new partnership focused on AI safety. The initiatives support the safe development of AI and seek to boost research in fields like quantum technology and low-carbon hydrogen. These efforts are part of a broader strategy to leverage scientific research for global advancement and demonstrate a commitment to international cooperation in science and technology. (Read the UK Government’s press release )\nResearch : GPT-4 demonstrates superior diagnostic skills in eye care Researchers showed that GPT-4 can match or even exceed the diagnostic capabilities of human eye specialists. The study compared GPT-4’s responses with those of 12 attending specialists and three senior trainees. The evaluation covered a diverse set of 20 ophthalmology questions and 20 patient cases, focusing on glaucoma and retina disorders, to assess the AI's accuracy and completeness of responses. The study revealed that GPT-4's responses were more comprehensive than those of the human specialists, particularly in the field of glaucoma. (Learn more at Daily.AI )\nAn AI model could enhance efficiency in robotic warehouses The approach addresses the challenge of coordinating hundreds of robots without collisions, outperforming traditional path-finding algorithms. By dividing the warehouse into smaller sections, the model employs a neural network architecture that encodes detailed information about the warehouse layout, robot paths, and obstacles, to quickly identify and alleviate traffic congestion among robots. In tests, the model achieved up to four times faster decongestion than conventional methods. (More details at MIT News )\nAdobe previews an AI audio tool Project Music GenAI Control will allow users to generate music based on text prompts, while also offering extensive editing controls. Aimed at content creators in need of customized audio, the tool will provide an interface for transforming audio with fine-grained adjustments, including tempo, structure, intensity, and more. (Read Adobe’s blog )\nU.S. Securities and Exchange Commission (SEC) probes OpenAI for potential investor misguidance The government agency is investigating OpenAI CEO Sam Altman's internal communications to determine if investors were misled, as part of an inquiry into Altman’s brief ouster last year for what board members called lack of candor. The investigation emerges amidst OpenAI's recent $80 billion valuation after a tender offer and intensifying global scrutiny over its practices and partnership with Microsoft. (Read the story at The Wall Street Journal )\nGoogle partners with Stack Overflow to integrate knowledge base into Gemini A new API, named OverflowAPI, will enable Google to incorporate validated Stack Overflow answers directly into the Google Cloud console, enhancing the Gemini service for Google Cloud. The partnership also explores using Google's Vertex AI platform to bring AI assistance to Stack Overflow's question-asking and moderation processes. (Read more at TechCrunch )\nAI uncovers reasons behind humpback whale deaths A study published in Royal Society Open Science revealed a dramatic decline in the North Pacific humpback whale population, with approximately 7,000 whales dying between 2012 and 2021. This decline, accounting for a 20 percent reduction in population, is attributed to a prolonged marine heatwave that began in 2013. Researchers claim their use of AI technology to automatically recognize over 30,000 individual humpback whales across more than 200,000 encounters marked a significant advancement in marine research, enabling an unprecedented scale of data analysis. (Get the details at ABC News )\nEleutherAI introduces guide for foundation model development EleutherAI, in collaboration with several leading research institutions and AI organizations, launched \"The Foundation Model Development Cheatsheet,\" a resource aimed at guiding developers through the process of building AI models. (Read EleutherAI’s press release and access the cheatsheet here )\n\n\n",
  "image_filename": "data-points-issue-239.png"
}