{
  "title": "Switching from NVIDIA; Plus, OpenAI’s Voice Engine",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-243/",
  "text": "This week's top AI news and research stories featured details about Microsoft's absorption of Inflection AI, Nvidia’s latest chip, a voluntary commitment to internal and external oversight of machine learning models by scientists, and a procedure that fine-tunes large language models (LLMs) to increase their truthfulness without collecting human feedback. But first:\nTech coalition wants to make it easier to switch from Nvidia A collective of companies, including giants like Qualcomm, Google, and Intel, is developing an open source suite of tools and software designed to function across a variety of AI accelerator chips. The coalition, called the UXL Foundation, wants to ease AI companies’ dependency on Nvidia's ecosystem. Google, a key member of this consortium, is involved in guiding the technical direction of the initiative, which is founded on Intel's OneAPI technology. UXL's goal is to add flexibility to the AI development ecosystem, offering developers  more hardware choices. (Read the story at Reuters )\nOpenAI probes synthetic voicemarket with Voice Engine OpenAI has been quietly testing a new product called Voice Engine, a model for turning text and voice input into synthetic voices that sound like the original speaker. Voice Engine has already helped develop the company’s text-to-speech API and ChatGPT Voice and Read Aloud products. Potential applications include automated voice translation and assisting users with disabilities. However, OpenAI has been reluctant to release the product more widely because of concerns it might be abused. (Read OpenAI’s initial findings at the company blog .)\nU.S. city tests AI to identify homeless encampments San Jose, California embarked on a controversial project to train AI algorithms to spot signs of homelessness, such as tents and occupied vehicles. The city teamed up with tech firms to collect street footage via a camera-mounted municipal vehicle. The initiative aims to address complaints such as illegal dumping and graffiti by enabling more efficient city responses, but has sparked concern among local outreach workers and national housing advocates about potential punitive uses against the unhoused population. (Learn more at The Guardian )\nAnthropic introduces Claude 3 prompt library for enhanced chatbot interactions The library features a collection of prompts for the Claude 3 chatbot to inspire users and improve their interaction experiences. Available on Anthropic's website, prompts are categorized as entertainment, work, and user-generated content. Users can try these prompts to explore the chatbot's capabilities in humor, dream analysis, recipe creation, web development, fashion suggestions, and more. (Read more at Tom’s Guide )\nFinancial Times launches a chatbot that responds to queries using the publication's archive of articles Ask FT, currently in beta, provides answers to user queries based on articles dated between March 1, 2023, and March 20, 2024, with the goal of providing up-to-date and referenced answers. Although the system, powered by Anthropic's Claude, shows promise with its ability to pull relevant information and cite sources, it has displayed inconsistencies, such as including politicians in a 2024 election list who are no longer candidates. (Find out more at The Verge )\nAdobe’s new Firefly Services offers over 20 generative AI APIs to developers The new set of APIs enables developers to integrate AI-powered features from Adobe’s Creative Cloud, such as Photoshop, into their own custom workflows or to develop entirely new applications. Firefly Services aims to automate workflows with APIs for tasks like background removal, smart cropping, and photo leveling, and includes access to advanced Photoshop capabilities like Generative Fill and Expand. Adobe also unveiled Custom Models, a feature that lets businesses tailor Firefly models with their unique assets for even more personalized content creation. (Learn more at TechCrunch )\nU.S. President Biden directs every federal agency to appoint a chief AI officer The White House announced a new policy initiative requiring senior officials to take charge of their agencies’ use of AI. The new AI officers (who may also fill other roles like chief information or chief technology officer) must be appointed within 60 days. The White House also set a target date of December 1st of this year for all federal agencies to correct any non-compliant uses of AI in government business. Agencies and their AI officers will need to take special care to ensure any government use of AI doesn’t negatively impact safety, privacy, or civil rights. (Learn more about the directive at Ars Technica )\nApple in preliminary discussions with Baidu to incorporate AI into its devices within China While Apple has also discussed partnering with companies like Google and OpenAI for its global AI needs, the Chinese market presents unique challenges. No foreign AI models have been approved in China since the introduction of new AI regulations, and Apple is seeking to partner with a local AI provider to navigate these hurdles. (Read the news at The Wall Street Journal )\nCongressional aides barred from using Microsoft Copilot for government use The U.S. House of Representatives has banned Microsoft’s AI engine due to concerns it may store data on unapproved cloud servers. The move follows a similar restriction on use of ChatGPT, but in that case staffers were still allowed to use the paid version of the chatbot in limited cases. Microsoft has promised to release a version of Copilot that meets government security and compliance requirements later this year. (Read about it at Axios )\nClaude 3 beats GPT-4 Turbo on the Chatbot Arena leaderboard for the first time Anthropic’s Opus has taken the top spot on LMSYS/HuggingFace’s AI leaderboard, as voted by thousands of chatbot users. Various versions of GPT-4 have led the Chatbot Arena board since the model’s introduction in May 2023. Claude’s smaller Sonnet and Haiku models are also performing well on the leaderboard, with Sonnet ranking just behind Gemini Pro and Haiku beating some older GPT-4 models. Researchers use the rankings to complement models’ quantitative benchmarks, amalgamating users’ qualitative perception of chatbots’ output and behavior. (See the other leaders at Chatbot Arena or read more about it at Ars Technica )\nChatGPT opens up to new users without requiring an email address or password OpenAI is gradually rolling out instant access to the free version of its chatbot, with the goal of reducing friction before new users can engage with the service. However, the signup-free version of ChatGPT has some limitations: stricter content safeguards, no access to the chatbot’s voice interface, and the absence of chat history. By default, anonymous user inputs will also be used to train OpenAI’s models, although this can be changed in user settings. (Learn more about the announcement at Open AI’s blog )\n\n\n",
  "image_filename": "data-points-issue-243.png"
}