{
  "title": "Adobe makes AI edits easier, HuggingFace’s FineWeb dataset, and a new AI safety board in the U.S.",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-247/",
  "text": "This week's top AI news and research stories featured Apple's new family of open large language models, Stanford’s seventh AI Index Report, Amazon's removal of its AI-driven checkout service, and an AI method to predict scientific discoveries. But first:\nAdobe’s new Firefly image model features AI photo editing The most notable addition, available in the new Photoshop beta, is the Reference Image feature, which allows users to upload their own images to guide the AI's output, matching elements like style and color. Other new tools include Generate Background for creating new backgrounds for product photos, Enhance Detail for increasing image clarity, Generate Similar for producing content similar to a selected generated image, and Generate Image for creating entire images from text descriptions. Adobe says the third-generation Firefly model delivers improved photorealistic quality and can better understand long, descriptive prompts. (Read more at The Verge )\nMicrosoft introduces Phi-3 family of open-source “small language” models Phi-3-mini, a 3.8 billion parameter model, is now available on Azure AI Studio, Hugging Face, and Ollama, with Phi-3-small (7 billion parameters) and Phi-3-medium (14 billion) coming soon. The small language models are designed for low resources, low latency, and low cost. (Find more details at Microsoft Azure’s blog )\nMeta AI update comes to smart glasses Ray-Ban Meta smart glasses now allow users to make video calls, letting them share what they see in real-time. The glasses feature Meta AI, an intelligent assistant that provides information based on voice commands and the glasses' camera feed. This AI update, currently in beta for US and Canadian users, enables the glasses to translate foreign language text or offer helpful suggestions based on what the user is looking at. (Read the news at Meta’s blog )\nAI companies join forces to combat child exploitation risks OpenAI, Meta, Google, and other AI companies partnered with child-safety organizations to implement new safeguards against the exploitation of children through generative AI tools. The alliance aims to minimize risks by avoiding using datasets with child sexual content, investing in testing to identify vulnerabilities, and adding signals to flag AI-generated content. (Read the story at The Wall Street Journal )\nAutonomous racecars debut at the Abu Dhabi Grand Prix Artificial Intelligence Autonomous Racing League (A2RL) held its first public demonstration featuring self-driving race cars on April 27 in Abu Dhabi. Eight teams competed for a $2.25 million prize using modified Dallara-built Super Formula SF23 cars, the fastest open-wheel racers outside of Formula 1, equipped with cutting-edge autonomous technology. While the cars looked similar, the extensive modifications, including drive-by-wire systems, sensor arrays, and onboard computers, allowed teams to showcase their AI coding skills. The race didn’t always go smoothly, but TUM was the winner. (Learn more at The Verge )\nU.S. forms AI safety board with tech CEOs The Biden administration established the Artificial Intelligence Safety and Security Board, which includes top executives from OpenAI, Nvidia, Microsoft, Alphabet, and other major companies. The board, working with the Department of Homeland Security, aims to develop recommendations for safely deploying AI within critical infrastructure sectors like power grids, transportation, and manufacturing. (Full story at The Wall Street Journal )\nAI-designed gene editor successfully edits human genome for the first time Profluent, a biotechnology company, used AI to design a gene editor called OpenCRISPR-1 that can precisely edit the human genome. By training large language models on over a million CRISPR operations, the company generated a diverse array of gene editors, some of which outperformed the commonly used SpCas9. While the AI-designed editors show promise, they still need to undergo clinical trials to assess their safety and efficacy before being used in healthcare applications. (Read more at The New York Times )\nMicrosoft and Amazon deals face U.K. antitrust scrutiny The U.K.'s Competition and Markets Authority (CMA) asked for public comments on partnerships between Microsoft and French AI firm Mistral, and Amazon and U.S. startup Anthropic. The regulator also inquired into Microsoft's hiring of former employees from Inflection AI. This invitation to comment is the first step in an information gathering process before the launch of a formal review to determine if Microsoft and Amazon’s partnerships with these AI companies qualify as mergers. (Check out the news at CNBC )\nHuggingFace’s FineWeb boasts 15 trillion tokens of optimized web data FineWeb is a new dataset of cleaned and deduplicated English web data from CommonCrawl, processed using the Datatrove library for optimal performance in large language models (LLMs). Although it initially aimed to replicate the RefinedWeb dataset, FineWeb's additional filtering steps enabled it to surpass RefinedWeb's performance and outperform models trained on other high-quality web datasets in benchmark tasks. (Access the dataset on Hugging Face’s website ) Snowflake unveils Arctic, an open-source, dense mixture-of-experts (MoE) model Arctic is designed for enterprise tasks such as SQL generation, coding, and instruction following. The model is noteworthy for its size, Apache 2.0 open-source license, and dense MoE hybrid transformer architecture, which combines a 10 billion parameter dense transformer model with a residual 128×3.66 billion MoE Multi-Layer Perceptron (MLP). This results in 480 billion total parameters but only 17 billion active parameters, making the model more efficient. (See the release notes on Snowflake’s website )\nFuture of Humanity Institute closes after 19 years The multidisciplinary research group at Oxford University founded by Nick Bostrom in 2005 conducted research on various topics related to humanity's future. FHI faced administrative challenges within the Faculty of Philosophy, including a freeze on fundraising and hiring starting in 2020. In late 2023, the Faculty decided not to renew the contracts of the remaining FHI staff, leading to the institute's closure on April 16, 2024. (See the announcement here )\n\n\n",
  "image_filename": "data-points-issue-247.jpg"
}