{
  "title": "The latest in AI from January 18 to January 24, 2024",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-233/",
  "text": "This week's top AI news and research stories featured a neural network that helps detect early signs of pancreatic cancer, a report on AI's impact on jobs, governments' pursuit of AI independence, and a new system that generates high-level geometry proofs. But first:\nMark Zuckerberg announces plan to develop open source artificial general intelligence (AGI) The initiative, revealed by the CEO of Meta in an Instagram Reel, involves bringing together Meta's AI research teams, FAIR and GenAI, to advance AGI and make it open source.  The announcement follows recent industry discussions on AGI's future, with Meta's commitment to open source development stirring debates on the strategic direction of AI research. (Learn more at VentureBeat )\nOpenAI removed ban on military use of ChatGPT The company eliminated explicit prohibitions against military applications of its technology, apart from direct weapons development, from its usage policy. OpenAI stated that the revision aimed to enhance clarity and readability while emphasizing the broad principle of not causing harm. The move comes amid increased interest in AI from government defense departments and raises concerns about AI's role in military activities. (Full article at The Intercept )\nChina presents draft guidelines to standardize AI industry The proposed draft outlines plans to establish more than 50 national and industry-wide standards for AI by 2026, in addition to actively participating in the formation of over 20 international AI standards. China’s industry ministry aims to have over 1,000 companies adopt and advocate for these standards, signaling a comprehensive effort to shape the future of AI development in the country. (Read the news at Reuters )\nEleutherAI to launch enhanced Pile v2, addressing ethical concerns and copyright issues The creator of the extensive Pile dataset is developing an updated version in collaboration with organizations like the University of Toronto and the Allen Institute for AI. The dataset aims to provide more diverse and high-quality content, with a focus on addressing copyright issues by incorporating public domain data, Creative Commons-licensed text, open source code, and explicit permissions for data reuse. (Read more at VentureBeat )\nJapanese author acknowledges using ChatGPT for about five percent of her award-winning novel Novelist Rie Kudan, recipient of the Akutagawa Prize, revealed that a small but significant percentage of her latest novel, \"Sympathy Tower Tokyo,\" was composed verbatim with the assistance of ChatGPT. Kudan, who considers AI an integral part of her writing toolkit, expressed a desire to maintain positive interactions with AI for future projects and highlighted the evolving relationship between human authors and AI in the literary landscape. (Read the news at The Economic Times )\nStability AI launches Stable Code 3B for code completion in software development With a focus on filling in missing sections of code, this 3-billion parameter model offers advanced code completion capabilities known as Fill in the Middle (FIM). The model, optimized with Rotary Position Embeddings (RoPE) for enhanced training, can run locally on laptops without dedicated GPUs. Its performance is competitive with larger models like Meta's CodeLLaMA 7B. The model is available through Stability AI’s membership subscription service. (Full article available at VentureBeat )\n$32,000 robot learns complex tasks, cooks meal with AI assistance Researchers at Stanford University developed an affordable wheeled robot, named Mobile ALOHA, with the capability to perform complex manipulation tasks. The robot was trained using reinforcement learning to autonomously execute various tasks, including cooking a three-course Cantonese meal, cleaning stains, and calling an elevator. Mobile ALOHA's success highlights the potential of inexpensive robot hardware enhanced by AI to tackle intricate tasks, with future plans to train the robot on more data for even more challenging activities, such as picking up and folding crumpled laundry. (Read the story at MIT Technology Review )\nSamsung unveils Galaxy S24 Series with multiple AI features Samsung placed a bet on AI capabilities in its latest smartphone series, aiming to rejuvenate consumer interest and regain its position in the smartphone market. The flagship S24 Ultra boasts advanced features driven by Samsung's Galaxy AI brand, such as instant phone call translation and Google's Circle to Search integration. (Get all the details at The Guardian )\nFlorida Bar pioneers ethical guidelines for attorneys harnessing AI The Florida Bar unanimously approved an 18-page opinion on ethical guidelines for lawyers using AI in their practice. The guidance covers a wide range of problems, from reviewing computer-generated work to fee structures and client confidentiality. While acknowledging the potential of AI, the guidelines emphasize the importance of lawyers understanding the technology to ensure responsible and ethical use, particularly in safeguarding client confidentiality. (Read more at Bloomberg Law )\nAustralia announces advisory body dedicated to overseeing AI The government aims to collaborate with industry bodies to introduce voluntary guidelines, encouraging technology companies to label and watermark content generated by AI. The voluntary nature of the initial guidelines contrasts with the mandatory rules on AI set by other jurisdictions like the European Union, reflecting the Australian government’s wish to foster responsible AI use through industry cooperation. (Read the full story at Reuters )\nHow AI will transform the travel industry in 2024 This year promises an AI-powered evolution, shaping various aspects of travel, from booking experiences to on-the-ground decision-making and algorithmic pricing strategies. The application of AI extends to improving behind-the-scenes operations at airlines and airports, enhancing automatic rebooking processes for flight disruptions, and a new breed of intelligent travel chatbots to redefine how users interact with platforms like Airbnb and Expedia. AI systems are also set to empower dynamic ticket-pricing algorithms, allowing airlines to optimize pricing based on factors such as weather predictions and customer searches. (Read more at The New York Times )\n“Fairly Trained,” a non-profit advocating for consent in AI training data usage The company aims to certify ethical practices in the use of generative AI tools. This initiative addresses concerns related to using data without explicit consent for training models. Co-founded by Ed Newton-Rex, former employee of (and vocal objector to) Stability AI, Fairly Trained advocates for obtaining consent from data creators and posters before using their work in AI training. (Read the news at VentureBeat )\nAcademic publisher Elsevier launches Scopus AI, a search platform for rapid paper summaries Scopus AI generates summaries and insights into relevant research papers. The platform minimizes the risk of AI hallucinations by utilizing verified knowledge from Scopus. Unlike ChatGPT, Scopus AI relies on peer-reviewed content and abstracts published since 2013 to ensure the latest knowledge is incorporated. After an alpha release in August 2023, Scopus AI is now available worldwide. (Visit Elsevier’s website to learn more and read the news at The Decoder )\nOpenAI outlines strategies to safeguard 2024 worldwide elections with AI tools The organization's initiatives focus on preventing abuse, ensuring transparency, and providing authoritative voting information. Efforts include enhancing transparency in AI-generated content by implementing digital credentials for image provenance and experimenting with a provenance classifier. OpenAI is also collaborating with organizations like the National Association of Secretaries of State to direct users to authoritative voting information sources. (Read all the details at OpenAI’s blog )\nMicrosoft expands Copilot reach with new features and premium subscription Copilot Pro, a premium subscription, offers enhanced AI capabilities, including access to models like GPT-4 Turbo and the ability to create personalized Copilot GPTs. Copilot for Microsoft 365, previously available for enterprises, is now accessible to businesses of all sizes. The Copilot mobile app is launched for iOS and Android, providing on-the-go access to Copilot's capabilities. Additional features include Copilot GPTs for customized behavior and the integration of Copilot into the Microsoft 365 mobile app for Android and iOS users. (Find more details at Microsoft’s press release )\nResearch : Student scientists discovered hidden similarities in fingerprints using AI Columbia University engineers disrupted a long-standing forensics belief by using AI to discover that fingerprints from different fingers of the same person share similarities. Contrary to the established notion that intra-person fingerprints are unique, the AI system, developed by Columbia Engineering undergraduate Gabe Guo and his team, achieved 77% accuracy in determining when fingerprints belonged to the same person. (Learn more at Columbia University’s blog )\nResearch : AI-enhanced catheter design mitigates bacterial infections Researchers at Caltech developed a catheter design that leverages AI optimization to prevent bacterial infections. Bacteria entering the body through catheters is a common healthcare issue, leading to substantial annual costs. The catheter design, developed by researchers at Caltech, disrupts bacterial movement without the need for antibiotics, reducing upstream swimming in laboratory experiments by a hundred times. The project is an interdisciplinary effort led by the laboratories in mechanical engineering, biology, and computer science. (More details at Caltech’s blog )\nScientists aim to decode and translate animal languages using generative AI Researchers are providing datasets of animal vocalizations to train AI algorithms. The goal is to unravel the complex communication systems of various species, potentially allowing humans to better comprehend the animal kingdom. (Read the story at Financial Times )\n\n\n",
  "image_filename": "data-points-issue-233.jpg"
}