{
  "title": "The latest in AI from December 28, 2023, to January 3, 2024",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-230/",
  "text": "This week's top AI news and research stories featured how GPT-4 can deceive users, an AI-powered microscope that detects cancerous tissue, a roadmap for the use of AI to reduce greenhouse gas emissions, and the boom of AI ventures in Paris, France. But first:\nJony Ive and Sam Altman recruit Apple executive for AI hardware project The renowned ex-Apple designer and the OpenAI executive recruited Tang Tan, an outgoing Apple executive, to lead hardware engineering. The collaboration aims to create advanced AI devices, with Altman providing software expertise. Ive envisions turning the project into a new company, focusing on home-oriented AI devices. (Read all about the project at Bloomberg )\nThe New York Times sues OpenAI and Microsoft for copyright infringement over AI training The suit, filed in Federal District Court in Manhattan, seeks billions of dollars in statutory and actual damages and demands the destruction of any chatbot models and training data using copyrighted material from The Times. This legal action could set copyright precedents in the rapidly evolving landscape of generative AI technologies, with potential implications for news and other industries. (Read more at The New York Times )\nMedia giants engage in complex negotiations with OpenAI over content licensing Several major players in the U.S. media industry have been engaged in confidential talks with OpenAI regarding licensing their content for the development of AI products. While some publishers like The Associated Press and Axel Springer have struck licensing deals with OpenAI, challenges persist in determining fair terms and prices for content usage in AI applications. (Read the story at The New York Times )\nMicrosoft expands Copilot AI chatbot to iOS and Android The app, previously available on Windows, provides users with AI-driven capabilities similar to OpenAI's ChatGPT. Users can ask questions, draft emails, summarize text, and create images using the integrated DALL-E3 text-to-image generator. Notably, Copilot offers GPT-4 access without requiring a subscription, distinguishing it from the free version of ChatGPT. Microsoft's move towards a standalone experience aligns with its rebranding of Bing Chat to Copilot and includes web and mobile applications on both Android and iOS platforms. (Read the article at The Verge )\nMIT and MyShell introduce OpenVoice, an open source voice cloning model Unlike proprietary solutions, OpenVoice offers granular control over tone, emotion, accent, rhythm, pauses, and intonation with just a small audio clip. The model, which combines a text-to-speech (TTS) model and a tone converter, was trained on diverse samples, allowing it to generate voice clones rapidly and with minimal compute resources. (Read more at VentureBeat )\nMidJourney introduces V6, enhancing image generation with text addition Improvements to the new version of the image generator include extended prompt length, enhanced control over color and shading, and the ability to incorporate text into images. The update also demonstrates advancements in interpreting prompts, recognizing nuances in punctuation and grammar. Accessible through Discord, MidJourney v6 allows users to imagine and refine creations using text prompts, with a web version in alpha release generating over 10,000 pictures. (Read the details at Tom’s Guide )\nCarnegie Mellon's Coscientist AI achieves chemistry feat, paving the way for scientific automation The AI system utilizes three distinct large language models, including GPT-4, to autonomously delve into the realm of chemistry. With specialized roles as Web Searcher, Documentation Searcher, and Planner, it works collaboratively to navigate web content, interpret lab equipment manuals, and plan and execute chemical reactions, showcasing promising capabilities in automating scientific experimentation. (Read more at Ars Technica and Science Daily )\nAI unravels Raphael's masterpiece mystery An algorithm developed by the University of Bradford may have resolved the centuries-old debate surrounding Raphael's painting, \"Madonna della Rosa,\" displayed in Madrid’s Prado Museum. The AI-aided research concluded that most of the painting is by Raphael, with the face of Joseph likely painted by another artist. The model, which analyzed 49 uncontested works by Raphael, recognizes authentic pieces with 98% accuracy, providing a new tool for art authentication. (Read the news at The Guardian )\nGoogle launches VideoPoet, an LLM for zero-shot video generation By integrating a pre-trained MAGVIT V2 video tokenizer and SoundStream audio tokenizer, VideoPoet transforms diverse modalities, such as images, video, and audio, into a unified vocabulary. The model's multimodal generative learning objectives include text-to-video, text-to-image, and image-to-video. (Read more at Google Research )\nU.S. intelligence agencies warn of alleged AI-driven espionage Instead of merely pilfering trade secrets, authorities fear that China could leverage AI to amass vast datasets on Americans, raising the stakes in a shadow war between the two nations. In addition to stealing secrets about AI, the FBI and other U.S. agencies worry that China might use AI to gather, analyze, and stockpile unprecedented amounts of data, posing a significant threat to national security. China has denied engaging in such activities. (Read the article at The Wall Street Journal )\nU.S. Supreme Court Chief Justice urges caution on AI's impact in legal field Chief Justice John Roberts of the U.S. Supreme Court has issued a year-end report expressing a wary stance on the influence of AI in the legal profession. Roberts acknowledged AI's potential to enhance access to justice and expedite legal processes but urged \"caution and humility\" in its implementation. This commentary comes as lower courts grapple to adapt to AI, with some observers proposing rules to regulate its use, particularly in generating legal content. (Read more at Reuters )\n\n\n",
  "image_filename": "data-points-issue-230.jpg"
}