{
  "title": "The latest in AI from December 14 to December 20, 2023",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-228/",
  "text": "In its winter holiday issue , The Batch revisits the generative AI boom across multiple fields — including reshaping the film and music industries and the challenges of training data, and the explosion of AI-driven doomsday scenarios. But first:\nFTC bars U.S. drugstore chain from using face recognition over consumer harm concerns Rite Aid faces a five-year ban on using face recognition technology for surveillance purposes following Federal Trade Commission (FTC) charges. The FTC asserts that Rite Aid failed to implement adequate safeguards, leading to consumer harm, misidentification, and privacy violations. According to the FTC, Rite Aid’s system falsely tagged consumers, disproportionately affecting women and people of color. (Read FTC’s press release )\nOpenAI introduced an AI safety framework, empowering board to reverse decisions The plan, called “Preparedness Framework,” outlines specific safety criteria, including cybersecurity and nuclear threat assessments, for deploying its latest technology. Additionally, OpenAI is establishing an advisory group to review safety reports, forwarding them to executives and the board for evaluation. The board retains the right to reverse decisions made by executive leadership. This move comes in response to the growing concerns surrounding the potential dangers of AI, particularly in the context of existential threats and disinformation. (Read more at Reuters and OpenAI )\nTesla to recall two million cars for Autopilot software updates Under the scrutiny of federal auto safety regulators, Tesla has committed to recalling two million cars to implement crucial updates. The software updates will introduce enhanced warnings and checks to ensure drivers remain attentive while utilizing the autonomous driving feature. Tesla owners don’t need to visit service centers, as the updates will be automatically applied to their vehicles. (Read the article at The New York Times )\nLAION-5B dataset linked to child exploitation material The dataset has been swiftly removed after Stanford researchers uncovered thousands of instances of suspected child sexual abuse material (CSAM). The dataset, used by major AI products like Stable Diffusion, contained 3,226 suspected instances of CSAM, prompting LAION to take down its datasets temporarily for safety reassessment. LAION acknowledged the potential presence of CSAM in its datasets as early as 2021. (Read more at 404 media )\nPakistan's former Prime Minister used AI to address supporters from jail Imran Khan's political party generated an audio clip from text written by Khan in prison. The party claimed that the message, delivered during a virtual event over a video image mimicking speech, reached six million viewers across platforms, accusing the interim government of internet manipulation to limit outreach. (Read all the details at BBC )\nMicrosoft partners with Suno to integrate AI-based music creation into Microsoft Copilot This partnership enables users, regardless of their musical expertise, to craft personalized songs using simple text prompts. Suno, an AI music technology company, can generate complete songs—including lyrics, instrumentals, and singing voices—from a sentence. (Read Microsoft Bing’s blog )\nUK Supreme Court rules AI can’t be recognized as patent inventor The Supreme Court unanimously rejected computer scientist Stephen Thaler's bid to register patents for inventions created by his AI system, DABUS. The court ruled that under UK patent law, an inventor must be a natural person, not a machine. Thaler's appeal, seeking recognition for AI-created inventions, was dismissed. The ruling emphasized that the court was not addressing broader questions about whether machines should be allowed to patent new innovations, only what existing patent law permits. (Read the story at Reuters )\nMicrosoft Research launches Phi-2, A 2.7 billion-parameter small language model (SML) Following the success of Phi-1, Phi-1.5, and the models’ state-of-the-art performances in Python coding and common-sense reasoning, Phi-2 demonstrates notable reasoning and language understanding capabilities, rivaling or outperforming models up to 25 times its size on complex benchmarks. According to Microsoft, the key innovation lies in the strategic use of high-quality training data, emphasizing \"textbook-quality\" information and leveraging knowledge transfer techniques from previous models. (Read Microsoft Research’s blog )\nGlobal publishing house Axel Springer and OpenAI forge partnership This agreement seeks to enhance user experiences with ChatGPT by incorporating recent, authoritative content from Axel Springer's media brands, including Politico and Business Insider. Users will receive curated summaries of global news content within ChatGPT, fostering transparency by attributing and linking to the original articles. (Read OpenAI’s announcement )\nMistral AI releases Mixtral 8x7B, a sparse mixture-of-experts (SMoE) model that outperforms GPT3.5 on benchmarks Licensed under Apache 2.0, Mixtral showcases impressive performance, surpassing Llama 2 70B on various benchmarks while boasting six times faster inference. Positioned as the most potent open-weight model with an open license, Mixtral can handle diverse languages, including English, French, Italian, German, and Spanish, and demonstrates proficiency in code generation. (Read Mistral’s press release )\nMicrosoft and AFL-CIO announce agreement on AI and labor neutrality The tech giant and the largest U.S. federation of unions committed to address the impact of AI on the workforce.Microsoft professed its neutrality in unionization efforts and support for employees and their affiliates in pursuing union formation. (Read the article at Reuters )\nGoogle Cloud introduces MedLM, a family of models fine-tuned for healthcare applications These models, built on Med-PaLM 2, offer flexibility for healthcare organizations with different needs. The larger MedLM model is geared for complex tasks, while the medium model is adaptable for scaling across various applications. Google has collaborated with healthcare organizations in MedLM’s development, and the family of models is already being employed in real-world scenarios. MedLM is currently available in the U.S. through the Vertex AI platform, with plans to expand access globally. (Read Google Cloud’s announcement )\nAlphabet to restrict election-related queries for Bard and AI search ahead of 2024 U.S. elections The restrictions, set to be enforced by early 2024, aim to address concerns about the potential misuse of AI in disseminating information during crucial election periods. Google said it would increase its focus on the role of AI in serving voters and campaigns related to significant global elections in 2024, including those in India, South Africa, and the United States. The move follows Meta's decision in November to prohibit political campaigns and advertisers from using its new generative AI advertising products. (Read more at Reuters )\nResearch : OpenAI releases white paper on responsible integration of agentic AI systems The document offers initial practices to ensure the safety and accountability of AI agents' operations, serving as foundational steps for developing agreed-upon best practices. Additionally, an Agentic AI Research Grant Program was initiated, offering grants ranging from $10,000 to $100,000 to support research on the impacts of agentic AI systems and safety developments. (Read OpenAI’s statement )\nGoogle Cloud launches Imagen 2 on Vertex AI Imagen 2, developed with Google DeepMind technology, provides an array of features for developers, including text rendering in multiple languages, logo generation, visual question and answering, and multi-language prompts. Several leading companies, including Snap, Shutterstock, and Canva, have already leveraged Imagen's capabilities for creative applications. (Read Google Cloud’s blog )\nMidjourney launches Alpha version of their website With access granted to those who have generated 10,000 or more images, the platform introduced three noteworthy features. Firstly, crafting images in Discord is now more user-friendly with simplified prompt controls. The \"Explore\" tab provides users with a collection of publicly available prompts. Additionally, users can access all their previous prompts on the Midjourney website. (Learn more at Midjourney’s blog )\nResearch : UC Berkeley researchers unveil learning-based locomotion controller for robots in real-world environments The team's controller, a causal transformer, leverages the history of a device’s proprioceptive observations and actions to predict subsequent actions. This helps enable autonomous adaptation to diverse environments. The model is trained through large-scale model-free reinforcement learning in simulated randomized environments and demonstrates impressive capabilities in real-world scenarios. (Read more at the software’s GitHub repository )\n\n\n",
  "image_filename": "data-points-issue-228.jpg"
}