{
  "title": "The latest in AI from January 4 to January 10, 2024",
  "url": "https://www.deeplearning.ai/the-batch/data-points-issue-231/",
  "text": "This week's top AI news and research stories featured new antibiotics discovered by deep learning, OpenAI’s new safety protocol, a new attempt to define what we mean when we say artificial general intelligence (AGI), and a training method that enables large language models (LLMs) and text-to-image generators to use both text and images as input or output. But first:\nMickey Mouse enters public domain, sparks AI creativity With three early Mickey Mouse cartoons entering the public domain on January 1, AI experimenters quickly leveraged the opportunity to play with the mouse. A digital humanities researcher uploaded an AI model trained on these cartoons to Hugging Face to generate still images based on written prompts (with sometimes garbled results). Although they are no longer covered by copyright, the legal implications of using the 1928 Mickey Mouse imagery in AI training data remain complex, with potential trademark considerations. (Read more at Ars Technica )\nMicrosoft adds Copilot key for Windows 11 PC keyboards The new key directly accesses the Copilot in Windows experience, and joins the Windows key as a central feature on the PC keyboard. This change aims to integrate AI capabilities into users' daily computing and simplify access to Copilot features. The key will become available later in January. (Read Microsoft’s blog )\nSurvey of AI researchers reveals wide range of views on the future of AI A survey involving 2,778 researchers (all publishing in top-tier AI venues) explored predictions on the trajectory of the field’sprogress. Key findings indicate a 50 percent chance of AI systems achieving significant milestones by 2028, with varying opinions on potential outcomes, including concerns about extreme scenarios such as human extinction. (Read all the survey results and insights at AI Impacts )\nAI continues to play a crucial role in wildfire detection and management Firetech startups like Pano AI in California use mountaintop cameras and AI to detect and pinpoint new wildfire ignitions in real time, aiding rapid response. Initiatives like FireAid, utilizing AI and machine learning, achieve an 80 percent accuracy rate in predicting wildfires, showcasing the transformative potential of technology in wildfire management. (Read the news at Reuters )\nResearch : JPMorgan launches DocLLM for multimodal enterprise document analysis The model is tailored to understand complex documents with both text and images. DocLLM skips complex image encoding, opting for a smart attention mechanism that disentangles text and layout info. It excels in handling irregular layouts and diverse content, and has outperformed other models in various tests. (Learn more at Analytics India Magazine )\nResearch : MIT researchers develop AI Agents that explain complex neural networks The method involves automated interpretability agents (AIAs) that mimic scientists' experimental processes, planning and conducting tests on computational systems to produce intuitive explanations. The researchers also introduced a benchmark, Function Interpretation and Description (FIND), to evaluate the quality of AI-generated explanations. (Read more at MIT News )\n\n\n",
  "image_filename": "data-points-issue-231.jpg"
}