{
  "title": "Robots Work the Drive-Thru",
  "url": "https://www.deeplearning.ai/the-batch/drive-thru-fast-food-restaurants-are-rolling-out-chatbots-to-take-orders/",
  "text": "Chatbots are taking orders for burgers and fries — and making sure you buy a milkshake with them.\nWhat’s new: Drive-thru fast-food restaurants across the United States are rolling out chatbots to take orders, The Wall Street Journal reported . Reporter Joanna Stern delivers a hilarious consumer’s-eye view in an accompanying video .\nHow it works: Hardee’s, Carl’s Jr., Checkers and Del Taco use technology from Presto, a startup that specializes in automated order-taking systems. The company claims 95 percent order completion and $3,000 in savings per month per store. A major selling point: Presto’s bot pushes bigger orders that yield $4,500 per month per store in additional revenue.\nPresto uses proprietary natural language understanding and large language model technology. It constrains the bot to stick to the menu if customers make unrelated comments.\nApproached by a customer, it reads an introductory script and waits for a reply. Then it converses until it determines that the order is complete (for instance, when the customer says, “That’s it”). Then it passes the order to human employees for fulfillment.\nThe Presto bot passes the conversation on to a human if it encounters a comment it doesn’t understand. In The Wall Street Journal ’s reporting, it did this when asked to speak with a human and when subjected to loud background noise. However, when asked if a cheeseburger contains gluten, it erroneously answered, “no.”\nPresto optimizes its technology for upsales: It pushes customers to increase their orders by making suggestions (“Would you like to add a drink?”) based on the current order, the customer’s order history, current supplies, time of day, and weather.\nBehind the news: The fast-food industry is embracing AI to help out in the kitchen, too.\nIn late 2022, Chipotle began testing AI tools from New York-based PreciTaste that monitor a restaurant location’s customer traffic and ingredient supplies to estimate which and how many menu items employees will need to prepare.\nSince 2021, White Castle has deployed robotic arms from Southern California-based Miso Robotics to deep-fry foods in more than 100 locations.\nIn 2021, Yum! Brands, which owns KFC, Pizza Hut, and Taco Bell, acquired Dragontail Systems, whose software uses AI to coordinate the timing of cooking and delivering orders.\nYes, but: McDonald’s, the world’s biggest fast-food chain by revenue, uses technology from IBM and startup Apprente, which it acquired in 2019. As of early this year, the system achieved 80 percent accuracy — far below the 95 percent that executives had expected.\nWhy it matters: In fast food, chatbots are continuing a trend in food service that began with Automat cafeterias in the early 1900s. Not only are they efficient at taking orders, apparently they’re more disciplined than typical employees when it comes to suggesting ways to enlarge a customer’s order (and, consequently, waist).\nWe’re thinking: When humans aren’t around, order-taking robots order chips.\n\n\n",
  "image_filename": "drive-thru-fast-food-restaurants-are-rolling-out-chatbots-to-take-orders.jpg"
}