{
  "title": "Drones Against Climate Change",
  "url": "https://www.deeplearning.ai/the-batch/drones-against-climate-change/",
  "text": "In self-driving cars, the laser-radar hybrid known as lidar senses surrounding objects to determine the path of a vehicle. In drones, it’s being used to see through forests to evaluate the impact of climate change on the ground.\nWhat’s new: Drones equipped with lidar are flying over forests in Scotland. Unlike satellite photos, lidar can penetrate the canopy, which remains green throughout the year, to see the forest floor. The resulting imagery enables scientists to track encroachment of nonnative plants that are killing trees, as well as soil degradation, drought, and other conditions, according to BBC News .\nHow it works: Ecometrica, which calls itself a downstream space information company, operates the drones as part of a UK-funded program to evaluate threatened forests around the world.\nLidar can’t see through leaves, but laser pulses can find their way through gaps, bounce off the ground, and return, providing a view of ground-level conditions.\nEcometrica melds the lidar signal with satellite imagery, GPS coordinates, and other information to create a three-dimensional map of the forest floor.\nThe company uses machine learning algorithms that detect changes like deforestation. It has found that traditional ML techniques such as random forests tend to be fast and cost-effective.\nWhy it matters: Scotland’s forests, which once covered much of the country, have dwindled to 4 percent of total land area. Climate change is spurring rhododendron, a flowering shrub introduced in the 1700s, to move into the remnant forests. There, it spreads fungal diseases and toxic leaf litter that damage the trees. The drone imagery will help prioritize trouble spots for eradication efforts.\nTakeaway: Beyond their commercial uses, emerging technologies including drones, lidar, and AI hold hope of solving dire environmental problems. Combining them effectively is an important part of the solution as climate change sets in.\n\n\n",
  "image_filename": "drones-against-climate-change.png"
}