{
  "title": "AI Hasn’t Been So Bad for Jobs",
  "url": "https://www.deeplearning.ai/the-batch/employment-has-risen-in-some-automation-heavy-professions/",
  "text": "Worries that automation is stealing jobs may have been greatly exaggerated.\nWhat’s new: A U.S. government report found that employment has increased in many occupations that may be threatened by automation.\nProjected versus actual growth: Bureau of Labor Statistics sociologist Michael J. Handel identified 11 occupations at risk from AI. He calculated changes in employment between 2008 and 2018.\nThe 11 professions grew by 13.9 percent, on average, during those years.\nAmong the largest gains: Jobs for interpreters and translators grew 49.4 percent, positions for personal financial advisors increased 30.4 percent, fast food and counter work expanded 29.7 percent, and manual labor and freight jobs grew 27.5 percent.\nOnly two of the 11 professions declined. Maids and housekeepers edged downward 0.2 percent, while surgeons outside of ophthalmology fell by 30 percent. Roomba and da Vinci notwithstanding, automation doesn’t seem to be implicated in those declines.\nLooking forward: Handel’s 13.9 percent estimate is reasonably close to the 8.7 percent rate projected by the Bureau of Labor Statistics at the beginning of that period. The agency’s projection for 2019 to 2029 expects the same occupations to grow by a more leisurely 5.8 percent on average. Handel attributes most of the slowdown to an aging population.\nYes, but: The report cites occupations that suffered losses between 2008 and 2018 due, in part, to technologies other than AI: tax preparer (down by 9.7 percent), ticket agent (20.5 percent), and journalist (28.3 percent). And then there are telemarketers, who suffered a 50 percent decline in jobs as regulators clamped down on nuisance calls and — yes — now face challenges from AI systems. Behind the news: This study joins previous research that runs counter to fears that robots will steal human jobs .\nStudies of the use of industrial machinery and employment rates in Finland, Japan, France, and the UK found that increased automation is associated with more jobs and higher productivity in industries with high rates of automation.\nUnemployment rates in most of the 38 countries that make up the Organization for Economic Co-Operation and Development were lower in April 2022 than February 2020, before the spread of Covid-19. Some economists fretted that the pandemic would drive a wave of job-killing automation.\nWhy it matters: A 2022 U.S. survey of 1,225 people by chat software developer Tidio found that 65 percent of respondents — including 69 percent of university graduates — feared that they soon would lose their jobs to automation. The new report could improve people’s trust in technology by showing how such worries have played out in recent years. It should spur thinking about how to integrate AI safely and productively into workplaces of all kinds. We’re thinking: Automation has always been a part of industrialized societies, and its impacts can be substantial. (How many elevator operators do you know?) However, when it complements human work, it often leads to job growth that counters the losses — for example, the rise of automobiles led to lots of work for taxi drivers.\n\n\n",
  "image_filename": "employment-has-risen-in-some-automation-heavy-professions.jpg"
}