{
  "title": "Crash Tracker",
  "url": "https://www.deeplearning.ai/the-batch/event-data-recorders-got-an-update-for-self-driving-cars/",
  "text": "Event data recorders, also known as black boxes, got an update for the era of self-driving cars.\nWhat’s new: The Institute of Electrical and Electronics Engineers published guidelines for internal devices that track the performance of autonomous road vehicles.\nHow it works: Like airplanes, cars and trucks carry event data recorders that capture their moment-to-moment behavior for examination in the event of a crash. The new specification calls for vehicles with Level 3 autonomous capabilities or higher, which can drive themselves but may require a human driver to take over, to carry a recorder dedicated to automated driving functions. The working group will meet later this year to discuss further revisions that address subjects like cybersecurity and protocols accessing recorded data.\nThe autonomous-driving recorder logs when a vehicle’s self-driving function is activated or deactivated, when the driver’s action overrides it (for instance, by manually braking or turning the wheel), or when it overrides a driver’s action.\nThe recorder also logs when the vehicle fails to stay in its lane, starts or ends an emergency maneuver, suffers a major malfunction, or collides with another object.\nThe minimum log entry includes an event, the event’s cause, and its date and timestamp to the second.\nA tamper-resistant electronic lock restricts access to recorded data.\nBehind the news: Event data recorders became a fixture in road vehicles decades ago as a way to evaluate the performance of safety airbags. Today, they record parameters such as speed, acceleration, and braking in 99 percent of new vehicles in the United States. They’ll be mandatory in new cars in the European Union starting next year.\nWhy it matters: As more automated driving systems hit the road, safety concerns are on the rise. Event data recorders help shed light on mishaps, and the resulting data can help authorities, manufacturers, and consumers to understand the role, if any, played by self-driving technology. Although compliance is voluntary, IEEE standards are influential and widely followed.\nWe’re thinking: Self-driving systems have the potential to reduce road and pedestrian fatalities dramatically. A clear picture of what goes wrong and why will enable engineers to improve self-driving technology steadily. Ultimately, we hope, accidents will become rare and relatively inconsequential.\n\n\n",
  "image_filename": "event-data-recorders-got-an-update-for-self-driving-cars.png"
}