{
  "title": "Face Recognition in the Crosshairs",
  "url": "https://www.deeplearning.ai/the-batch/face-recognition-in-the-crosshairs/",
  "text": "Unfounded worries over malevolent machines awakening into sentience seem to be receding. But fears of face recognition erupted last week — the rumblings of a gathering anti-surveillance movement.\nWhat's new: Recent events cast a harsh light on the technology:\nSan Francisco banned use of face recognition systems by municipal agencies including law enforcement. Two other California cities, Oakland and Berkeley, are considering bans. So is Somerville, Massachusetts.\nInvestors in Amazon, whose Rekognition system identifies faces as a plug-and-play service, are pressing the company to rein in the technology.\nThe U.S. House of Representatives scheduled a hearing on the technology’s implications for civil rights.\nThe Georgetown Law Center on Privacy & Technology published two reports sharply critical of law-enforcement uses of such technology in several U.S. states, detailing a variety of apparent misuses and abuses.\nBackstory: Face recognition is still finding its way into industry — Royal Caribbean reportedly uses it to cut cruise-ship boarding time from 90 to 10 minutes — but it has quietly gained a foothold in law enforcement:\nAuthorities in Chicago, Detroit, New York, Orlando, and Washington, DC, have deployed the technology. Los Angeles, West Virginia, Seattle, and Dallas have bought or plan to buy it.\nBut police departments are using it in ways that are bound to lead to false identification.\nNew York detectives searching for a man they thought looked like actor Woody Harrelson searched for faces that matched not the suspect, but Harrelson, according to the Georgetown Law Center.\nA handful of police departments in the U.S. permit searching for faces that match hand-drawn sketches based on witness descriptions, although such searches “mostly fail,” according to the National Institute of Standards and Technology.\nWhy it matters: Face recognition has a plethora of commercial uses, and law enforcement has employed it productively in countless cases. However, critics see potential chilling effects on free speech, erosion of privacy, reinforcement of social biases, risk of false arrest, and other troubling consequences. Now is the time to study possible restrictions, before the technology becomes so thoroughly embedded that it can’t be controlled.\nWhat they’re saying: “People love to always say, ‘Hey, if it's catching bad people, great, who cares,’ until they're on the other end.” — Joshua Crowther, a chief deputy defender in Oregon, quoted by the Washington Post\nSmart take: Face recognition, whether it's used in the public or private sphere, has tremendous potential for both good and ill. The issue isn’t bad technology, but misuse. It’s incumbent on AI companies to set bright-line standards for using their products and to build in ready ways of enforcing those standards. And it’s high time for government agencies to hammer out clear policies for using the tech, as well as audit processes that enable the public to evaluate whether those policies are being met.\n\n\n",
  "image_filename": "face-recognition-in-the-crosshairs.png"
}