{
  "title": "Better Pay for Data Workers",
  "url": "https://www.deeplearning.ai/the-batch/google-contractors-get-a-raise/",
  "text": "Contract workers who help train the algorithms behind Google Search won a pay raise. What’s new: Employees of U.S. contractors who evaluate the quality of Google Search’s results, knowledge panels, and ads will earn $15 per hour, a raise of roughly $1, Bloomberg reported .\nPay raise: The Alphabet Workers Union (AWU), an unofficial labor union that represents U.S.- and Canada-based employees of Alphabet, its subsidiaries, vendors and contractors, negotiated the raise. The deal will affect around 5,000 workers, most of whom work remotely for Seattle-area RaterLabs.\nThis raise follows one that occurred in January, when RaterLabs agreed to pay its employees between $14 and $14.50 per hour. Previously, they earned a minimum of $10 an hour.\nAWU won both raises by pressuring Google to extend its 2019 Wages and Benefits Standard , which originally didn’t apply to contractors. The standard calls for all U.S.-based employees to earn at least $15 per hour beginning in 2020.\nAWU plans to negotiate for other benefits described in the standard including health insurance and paid time off.\nBehind the news: Large AI developers like Google and OpenAI often outsource rote tasks like labeling data and evaluating outputs. The contractors have come under fire for underpaying workers.\nWorkers have accused Appen, RaterLabs parent company, of delaying payments. (Appen, whose clients include Google, YouTube, and Facebook, pays much of its U.S.-based workforce around $10 an hour, less than the minimum wage in more than half of U.S. states.)\nWorkers in Venezuela and North Africa contend that Scale AI, a company that labels data for clients including Lyft, Nuro, Microsoft, OpenAI, and Skydio, has arbitrarily withheld or reduced their pay.\nOpenAI reportedly hired Sama, which is based in Kenya, to rate the output of its ChatGPT text generator, aiming to reduce the model’s toxic output. Sama paid its employees between  $1.32 and $2 per hour, roughly equivalent to minimum wage for service-sector jobs in Nairobi.\nWhy it matters: AI products like search engines, language models, and autonomous vehicles can earn billions for the companies that develop them. Yet many of the workers who contribute to them receive relatively low wages.\nWe’re thinking: We’re glad to see wages rising for workers whose input is crucial to building AI systems. For a thoughtful treatment of tech labor issues, we recommend Gray and Suri’s excellent book, Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass .\n\n\n",
  "image_filename": "google-contractors-get-a-raise.gif"
}