{
  "title": "More Tesla Crashes",
  "url": "https://www.deeplearning.ai/the-batch/government-data-shows-increase-in-teslas-autonomous-car-collisions/",
  "text": "Tesla cars operating semi-autonomously have had many more collisions than previously reported, government data shows.\nWhat's new: Tesla vehicles operating in the so-called Autopilot or Full Self-Driving mode were involved in 736 U.S. crashes between sometime in 2019 and May 2023, according to data gathered by the United States National Highway Traffic Safety Administration (NHTSA), The Washington Post reported . Earlier data showed that Teslas had been involved in 273 reported crashes between July 2021 and July 2022. The latest data is available at the bottom of this link .\nHow it works: Tesla offers two semi-autonomous driving modes.\nAutopilot, a standard feature since 2015 that’s currently installed in more than 800,000 vehicles, enables Tesla vehicles to keep themselves in the center of their lane, change lanes, and enter and exit parking spots autonomously.\nWhat the company calls Full Self-Driving is an optional upgrade that enables Teslas to drive themselves between destinations and automatically brake at intersections and hazards. All Teslas manufactured since 2019 are equipped with the hardware to support this mode, which can be activated for $15,000 or around $99 per month.\nThe crashes: The NHTSA data is difficult to interpret, since it omits crucial variables such as miles driven and which of Tesla’s two modes was involved in any given crash. Moreover, the earlier and recent crash tallies are difficult to compare due to the difference in their time frames.\nTwo-thirds of reported incidents occurred since June 2022, and 17 resulted in fatalities.\nThe highest quarterly total roughly coincides with Tesla’s decision in November 2022 to stop restricting Full Self-Driving to Tesla owners whose driving scored highly on certain safety metrics and offer the upgrade to all customers — about 400,000 drivers — regardless of their safety score.\nTesla’s own safety report , unlike the NHTSA data, tallies accidents per mile driven, comparing driving with Autopilot engaged, driving without Autopilot, and the U.S. average. It shows that, during the period covered by the NHTSA report, Teslas driving with Autopilot engaged experienced far fewer crashes per mile driven than both Teslas driving without Autopilot and the U.S. average. The Tesla report does not include crashes while driving with Full Self-Driving engaged.\nBehind the news: Since August 2021, NHTSA has opened numerous probes into Tesla’s autonomous systems. Repeated incidents under investigation include abrupt braking in the path of following vehicles; collisions with emergency vehicles; and allegations that, in multiple crashes, Autopilot disengaged less than a second before the collision, giving drivers little time to react.\nWhy it matters: Tesla has claimed repeatedly that its autonomous driving capability is far safer than human drivers. Without knowing which mode was involved in how many crashes over how many miles, that claim is impossible to verify. Meanwhile, there are indications that Tesla may have deliberately misled the public about its self-driving capabilities in the past.\nWe're thinking: Engineers who work on systems that are critical to safety have a special responsibility to make sure their products are safe and well understood by users. We urge Tesla engineers to shed more light on the performance of these potentially life-threatening systems.\n\n\n",
  "image_filename": "government-data-shows-increase-in-teslas-autonomous-car-collisions.jpg"
}