{
  "title": "Pop Star Invites AI Imitation",
  "url": "https://www.deeplearning.ai/the-batch/grimes-released-a-voice-cloning-tool/",
  "text": "A popular musician is inviting fans to clone her voice. Result: a flood of recordings that sound just like her. What’s new: Experimental pop star Grimes released GrimesAI-1, a generative audio tool that allows anyone to make recordings of their own singing or speech sound like her voice. As of May 24, users had generated more than 15,000 cloned vocal tracks and submitted more than 300 fully produced songs to streaming services, The New York Times reported .\nHow it works: GrimesAI-1 is available on elf.tech , a website built by Grimes and artist-management company CreateSafe .\nGrimesAI-1 was trained on vocal recordings of the artist’s voice both unprocessed and altered with effects such as reverb.\nUsers can upload existing vocal recordings or use the tool to record new performances. Users can add backing music using the audio production applications of their choice. Then they can click a button to upload their creations to streaming services.\nIn a tweet, Grimes invited people to try to earn money using her AI-cloned voice in exchange for half of any resulting royalties.\nBehind the news: Generative audio tools like Murf.ai and Respeecher are fueling a surge of cloned songs in the styles of popular artists. In April, Universal Music Group, one of the world’s largest owners of music rights, asked streaming services including YouTube and Spotify to take down AI-generated songs. Why it matters: Some voice actors license their voices for use in AI-generated likenesses. Grimes has gone one step further, giving her fans the tools and terms they need to mimic her voice — and perhaps even make money. We’re thinking: While major players in the music industry aim to shut off the spigot of generated music, Grimes is collaborating with her fans. That sounds like a more productive and democratic response.\n\n\n",
  "image_filename": "grimes-released-a-voice-cloning-tool.gif"
}