{
  "title": "Harry Shum",
  "url": "https://www.deeplearning.ai/the-batch/harry-shum-assisted-artistry/",
  "text": "In 2021, I envision that the AI community will create more tools to unleash human creativity. AI will help people across the globe to communicate and express emotions and moods in their own unique ways. We have created machines that excel at logical tasks, capable of calculating at a scale and speed that far exceed human abilities. This accomplishment is evident in the recent successes of lunar probes, which have gone to the moon and returned with material for study. In our everyday lives, we use tools such as Microsoft Word and Excel to boost our productivity. However, there are some tasks at which humans continue to reign supreme — especially in the arts. A human brain has a logical side, or left brain, which is complemented by the creative and imaginative right brain. This creative side sparks many of the daily interactions that have allowed our species to flourish. We communicate with each other using language, conveying abstract concepts and expressing emotions. We also express ourselves artistically, creating music, art, dance, and design that hold meaning. Recent progress in AI, especially with deep learning techniques like generative adversarial networks and language models like GPT-3, has made it possible to synthesize realistic images and plausible texts almost out of nothing. XiaoIce.ai, a spin-out from Microsoft where I chair the board of directors, provides a chatbot that has shown human-like performance in generating poems, paintings and music. For example, XiaoIce helped WeChat users to write more poems in a week than all the poems previously created in the history of China! Aspiring practitioners of painting, music, poetry, or dance, to name a few of many art forms, must train in their disciplines for years. It is said that one needs to practice 10,000 hours to reach perfection. Tools like Xiaolce can reduce that investment substantially, helping anyone to create more sophisticated creative and imaginative expressions. I look forward to seeing more AI creation tools in the coming year to help people express their artistic ideas and inspirations. AI has already shown that it can help humans to be more productive. Now let’s turn our attention to helping people to unlock their creativity. Harry Shum is chairman of xiaoice.ai and an adjunct professor at Tsinghua University.\n\n\n",
  "image_filename": "harry-shum-assisted-artistry.png"
}