{
  "title": "Kevin Scott",
  "url": "https://www.deeplearning.ai/the-batch/kevin-scott-be-prepared-for-another-year-of-exponential-growth/",
  "text": "Without question, 2023 has been the most exciting and interesting year in technology that I’ve seen over a fairly long career. It bears mention that I’m pretty sure I said more or less the same thing at the close of 2022, and I suspect I’ll probably be saying the same around this time next year and each year for the foreseeable future—the point being that, in AI right now, we’re experiencing a period of sustained exponential growth that represents perhaps the most profound technological progress that we have ever seen.\nAnd it’s really only the beginning. Modern generative AI is still in its infancy, and we’re learning as we go. While it feels like we’ve lived with them for ages now, 2023 was really the first year that powerful AI tools like ChatGPT and Microsoft Copilots meaningfully entered the public vernacular as useful helpers to make people’s lives easier. By the time next year wraps up, we’ll have many new experiences, apps, and tools that will create cascading benefits for more and more people across the planet. Though the amplitude of hype and acceleration rate of AI’s growth can keep folks fixated on each subsequent “next big thing,” if we step back just a little bit, it’s easier to see that the opportunity in front of us is astronomically greater than what we’ve already achieved.\nBecause we only get to sample the product of that exponential curve every couple of years or so, most recently with GPT-4, it’s easy to forget in the interim how astonishing the pace of growth actually is. And, as is our human nature, we acclimatize very quickly and soon take for granted each immediate set of wild new possibilities offered to us.\nSo, my hope for all of us working in AI and technology over the next year is that we collectively remember that the next sample from the exponential is coming, and prepare ourselves appropriately for the (sure to be incredible) outcomes. If you haven’t done so already, pay close attention, experiment, and build AI production practices. If not, you’ll be too far behind to translate the progress into meaningful benefits for everyone.\nMay 2024 continue to bring the excitement of discovery and continued innovation for us all.\nKevin Scott is chief technology officer and executive vice president of AI at Microsoft.\n\n\n",
  "image_filename": "kevin-scott-be-prepared-for-another-year-of-exponential-growth.png"
}