{
  "title": "Kimi’s k1.5 is o1’s newest competitor; Learn how it was trained",
  "url": "https://www.deeplearning.ai/the-batch/kimis-k1-5-is-o1s-newest-competitor-learn-how-it-was-trained/",
  "text": "Twice a week, Data Points brings you the latest AI news, tools, models, and research in brief. In today’s edition, you’ll find:\nClaude’s Citations API makes it easier to track your sources\nBrowser Use challenges Computer Use, for free\nHow game developers both adopt and fear AI\nHunyuan’s new open model builds 3D assets with textures\nBut first:\nMoonshotAI develops new reasoning model using reinforcement learning\nKimi’s k1.5 model uses reinforcement learning techniques like online policy mirror descent and long context scaling to improve its chain-of-thought reasoning abilities. The model outperforms OpenAI’s o1 on multiple benchmarks for math, coding, and visual reasoning tasks. Kimi’s relatively simple and scalable approach to training allows the model to learn complex problem-solving strategies without relying on computationally intensive techniques like Monte Carlo Tree Search, value functions, or process reward models. ( arXiv and GitHub )\nImproved dataset helps vision model top pathology benchmarks\nMayo Clinic researchers developed Atlas, a new vision foundation model for digital pathology that outperforms existing models on multiple benchmarks. The model was trained on an unusually valuable data set of 1.2 million histopathology images from Mayo Clinic and Charité - Universitätsmedizin Berlin using an adapted RudolfV approach. Atlas achieved state-of-the-art results across 21 public benchmark datasets covering both molecular and morphology-related pathology tasks, despite not having the largest parameter count or training dataset. If adopted, this model could create applications that improve diagnostic accuracy and efficiency in analyzing tissue-based diseases, including cancers, inflammatory conditions, and degenerative disorders. But other researchers say this model, while state-of-the-art, is still too limited to replace human pathologists, and more data collection is needed to advance the field. ( arXiv and MIT Technology Review )\nCitations API simplifies verification for Claude developers\nAnthropic launched Citations, a new API feature that allows Claude to ground its responses in source documents. The feature processes user-provided documents by chunking them into sentences, which are then passed to the model along with user context and queries. Claude analyzes the query and generates responses with precise citations referencing the source material, minimizing hallucinations and increasing output reliability by up to 15 percent. The Citations API helps developers to create more trustworthy and transparent applications for use cases like document summarization, complex Q&A, and customer support. ( Anthropic )\nNew free-to-use tool streamlines web sites for automated agents\nA new AI-powered tool called Browser Use extracts interactive elements from websites, enabling agents to navigate and interact with them more effectively. Browser Use combines visual understanding with HTML extraction, manages multiple tabs, and supports various large language models, including GPT-4o, Claude Sonnet 3.5, and DeepSeek-R1, plus agent tools from LangChain and other providers. The product offers various pricing tiers, from a free open version to enterprise-level custom solutions, and claims to outperform other web automation tools like Computer Use or Mariner in accuracy. ( Browser Use and GitHub )\nGame industry grapples with layoffs amid AI adoption\nA recent survey of game developers suggests that approximately 11 percent of them experienced layoffs in the past year, with Narrative roles hit hardest at 19 percent. The survey found that 58 percent of developers expressed concern about future job security, while 30 percent reported that they believe generative AI negatively impacts the games industry. Despite concerns, 52 percent of respondents work for companies that have implemented generative AI. Surprisingly, 47 percent of developers over 55 use AI tools, compared to only 28 percent of those aged 18-34, suggesting a generational divide in AI adoption in gaming. ( Game Developers Conference , requires email registration)\nHunyuan unveils generative models that create 3D assets from images\nHunyuan released Hunyuan3D 2.0, an open AI system that generates high-quality 3D shapes with textures from 2D images. The system uses two main components: one for creating shapes and another for applying textures, along with an interactive platform called Hunyuan3D-Studio for manipulating and animating 3D assets. Hunyuan claims their new system outperforms competing open models like Michelangelo and Direct3D as well as unnamed closed models in producing detailed, accurately textured 3D models that closely match input images. ( arXiv and Hugging Face )\nStill want to know more about what matters in AI right now?\nRead last week’s issue of The Batch for in-depth analysis of news and research.\nLast week, Andrew Ng shared insights from the World Economic Forum in Davos, Switzerland, where he discussed AI business implementations, governance, and climate solutions, including geoengineering. He highlighted the potential of Stratospheric Aerosol Injection (SAI) to combat global warming and introduced an AI-powered climate simulator at planetparasol.ai to explore these possibilities.\n“I believe the risks associated with cooling down our planet will be much lower than the risks of runaway climate change. I hope we can build a global governance structure to decide collectively whether, and if so to what extent and how, to implement geoengineering.”\nRead Andrew’s full letter here .\nOther top AI news and research stories we covered in depth: DeepSeek-R1 emerged as an affordable rival to OpenAI’s o1, sharpening its reasoning capabilities; Unitree and EngineAI showcased affordable humanoid robots , breaking price barriers; Texas introduced a landmark bill to regulate AI development and use, further opening the door for state-level AI governance; and researchers combined deep learning with an evolutionary algorithm to design chips in minutes, revealing mysterious but effective processes in generated hardware designs.\nSubscribe to Data Points\n\n\n",
  "image_filename": "kimis-k1-5-is-o1s-newest-competitor-learn-how-it-was-trained.png"
}