{
  "title": "Computer Vision Made Easy!",
  "url": "https://www.deeplearning.ai/the-batch/landinglens-enables-anyone-to-build-in-minutes-models-that-used-to-take-months/",
  "text": "Dear friends,\nLanding AI, a sister company of DeepLearning.AI, just released its computer vision platform, LandingLens, for everyone to start using for free. You can try it here .\nLandingLens makes creating computer vision projects easy and fast. If you have 10 minutes, I encourage you to check it out by creating your own project. I also created a three-minute demo video, which you can see here .\nBuilding and deploying a machine learning system is often complicated and time-consuming. You have to collect data, implement a model or find an appropriate open-source model, build a data pipeline to get the data to the right place, develop or find a tool to label the data, train the model, tune hyperparameters, fix data issues, and eventually set up a deployment server and find a way to get the trained model to run on it.\nThis process used to take me months. With LandingLens, you can go from starting a project to deploying a model in minutes.\nMy team at Landing AI is obsessed with making computer vision easy. The key to making this possible is our data-centric AI approach. Our back end automatically trains a highly tuned model as long as you provide good data. After initial training, you can carry out error analysis and improve the data (or use advanced options to tune hyperparameters if you want) to further improve your model’s performance.\nLandingLens has been used successfully in manufacturing, life sciences, satellite imaging, medical imaging, agriculture, entertainment, and many other industries.\nToday, companies can visualize and analyze their structured data to derive value from it using tools like pandas, seaborn, matplotlib, and tableau. But many also have collections of images sitting in storage that have yet to be analyzed. If you think this might be true of your organization, please check out LandingLens. I believe you'll find it easy to start experimenting and getting value from your images.\nYou can start using LandingLens for free here .\nIf you build or discover something cool and are willing to share what you've found, please let us know at Landing AI's community website . I look forward to seeing what you build.\nKeep building!\nAndrew\nP.S. Now that the mechanics of building a computer vision system are easy, I’ve been thinking a lot about new frameworks to approach machine learning problems that are less academic and more practical. For example, I see test sets as unnecessary for many applications. I will share more about this in the future.\n\n\n",
  "image_filename": "landinglens-enables-anyone-to-build-in-minutes-models-that-used-to-take-months.gif"
}