{
  "title": "Learning to Code is Easier Than Ever!",
  "url": "https://www.deeplearning.ai/the-batch/learning-to-code-is-easier-than-ever/",
  "text": "Dear friends,\nI’m delighted to announce AI Python for Beginners , a sequence of free short courses that teach anyone to code, regardless of background. I’m teaching this introductory course to help beginners take advantage of powerful trends that are reshaping computer programming. It’s designed for people in any field — be it marketing, finance, journalism, administration, or something else — who can be more productive and creative with a little coding knowledge, as well as those who aspire to become software developers. Two of the four courses are available now, and the remaining two will be released in September.\nGenerative AI is transforming coding in two ways:\nPrograms are using AI: Previously, you had to learn a lot about coding before it became useful. Now, knowing how to write code that calls large language models (and other AI APIs) makes it possible to build powerful programs more easily. This is increasing the value of coding.\nAI is helping programmers: Programmers are using large language models as coding companions that write pieces of code, explain coding concepts, find bugs, and the like. This is especially helpful for beginners, and it lowers the effort needed to learn to code.\nThe combination of these two factors means that novices can learn to do useful things with code far faster than they could have a year ago.\nThese courses teach coding in a way that is aligned with these trends: (i) We teach how to write code to use AI to carry out tasks, and (ii) Unlike some instructors who are still debating how to restrict the use of ChatGPT, we embrace generative AI as a coding companion and show how to use it to accelerate your learning.\nTo explain these two trends in detail:\nPrograms are using AI. Because programs can now take advantage of AI, increasingly knowing a little bit about how to code helps people in roles other than software engineers do their work better. For example, I’ve seen a marketing professional write code to download web pages and use generative AI to derive insights; a reporter write code to flag important stories; and an investor automate first drafts of contracts. Even if your goal is not to become a professional developer, learning just a little coding can be incredibly useful!\nIn the courses, you’ll use code to write personalized notes to friends, brainstorm recipes, manage to-do lists, and more.\nAI is helping programmers. There is a growing body of evidence that AI is making programming easier. For example:\nA study at Cisco by Pandey et al. projects a “33-36% time reduction for coding-related tasks” for many cloud development tasks.\nMcKinsey estimates a 35 percent to 45 percent reduction in time needed for code generation tasks.\nIn study by Microsoft (which owns Github and sells Github Copilot), Github, and MIT, developers who used AI completed a programming task nearly 56 percent faster.\nFurther, as AI tools get better — for example, as coding agents continue to improve and can write simple programs more autonomously — these productivity gains will improve.\nIn order to help learners skate to where the puck is going, this course features a built in chatbot and teaches best practices for how beginners can use a large language model to explain, write, and debug code and explain programming concepts. AI is already helping experienced programmers, and it will help beginner programmers much more.\nIf you know someone who is curious about coding (or if you yourself are), please encourage them to learn to code! The case is stronger than ever that pretty much everyone can benefit from learning at least a little coding. Please help me spread the word, and encourage everyone who isn’t already a coder to check out AI Python for Beginners .\nAndrew\n\n\n",
  "image_filename": "learning-to-code-is-easier-than-ever.png"
}