{
  "title": "Machine Learning for Human Learners",
  "url": "https://www.deeplearning.ai/the-batch/machine-learning-for-human-learners/",
  "text": "AI is guiding admissions, grading homework, and even teaching classes on college campuses.\nWhat’s new: In a bid to cut costs, many schools are adopting chatbots, personality-assessment tools, and tutoring systems according to The Hechinger Report , an online publication that covers education. Critics worry that these systems may cause unseen harm.\nWhat they found: AI is used to help manage students at nearly every step in gaining higher education.\nBaylor University, Boston University, and others use personality-assessment software from Kira Talent to score applicants on traits such as openness, motivation, and “neuroticism.” Human administrators make the final call on who gets accepted.\nAfter accepting a new crop of candidates, Georgia State University uses a chatbot to send them encouraging messages. The system has increased the percentage who pay a deposit and enroll.\nAustralia’s Deakin University developed Genie , a chatbot that monitors student behaviors and locations. If it determines that a would-be scholar is dawdling in the dining hall, for instance, it will send a message to get back on-task.\nSouthern New Hampshire University is developing systems to grade homework and class participation. It monitors speech, body language, and how rapidly students respond to online lessons.\nElevateU produces instructional programs called “AI textbooks” that tailor the learning experience based on student preferences, actions, and responses.\nYes, but: Some observers say these systems may be giving inaccurate grades, contributing to bias in admissions, or causing other types of harm.\nAn AI grading system tested by researchers at MIT gave high marks to gibberish essays studded with key phrases that contributed to a good score.\nUniversity of Texas at Austin abandoned a system that evaluated graduate candidates after it was found to favor people whose applications resembled those of past students.\nLast year, the British government abandoned high-school rankings determined by an algorithm when the system gave 40 percent of students lower grades than their teachers would have assigned.\nWhy it matters: The pandemic exacerbated an ongoing decline in U.S. university enrollment, which has left colleges scrambling. Automated systems that are carefully designed and sensibly deployed could help streamline processes, reduce costs, and increase access.\nWe’re thinking: AI has its place on campus. For instance, chatbots can help students figure out where their classes meet. The technology doesn’t yet offer a substitute for good human judgement when it comes to sensitive tasks like assessing performance, but if it can show consistently fair and accurate judgement, it could help reduce the noise that currently afflicts human grading.\n\n\n",
  "image_filename": "machine-learning-for-human-learners.gif"
}