{
  "title": "Meta’s got a brand new herd",
  "url": "https://www.deeplearning.ai/the-batch/metas-got-a-brand-new-herd/",
  "text": "Twice a week, Data Points brings you the latest AI news, tools, models, and research in brief. In today’s edition, you’ll find:\nMicrosoft personalizes its multitasking Copilot\nMidjourney overhauls its leading image model\nAn early vibe coding entrant reenters a crowded field\nA cybersecurity-optimized version of Gemini\nBut first:\nMeta releases Llama 4 models, claiming superior performance\nMeta launched two new Llama 4 multimodal models, boasting performance improvements over previous generations and 10 million token context windows. Llama 4 Maverick, with 400 billion parameters, outperforms GPT-4o and matches DeepSeek v3.1 on several benchmarks, including MMMU and MathVista, with strong performance on MMLU-Pro’s reasoning tasks, GPQA Diamond’s expert-level knowledge, and LiveCodeBench coding tests. Meta’s team distilled both Maverick and Scout (a 109 billion parameter variant) from Llama 4 Behemoth, a not-yet-available 2 trillion parameter model that reportedly outperforms GPT-4.5 and other top models on STEM tasks. Developers can download Scout’s and Maverick’s weights from llama.com and Hugging Face, while Maverick costs an estimated $0.19-$0.495 per million tokens for inference. ( Meta )\nGoogle’s Gemini 2.5 Pro introduces a price increase\nGoogle released API pricing for Gemini 2.5 Pro, charging $1.25 per million input tokens and $10 per million output tokens for prompts up to 200,000 tokens and $2.50/$15 per million input/output tokens for longer prompts. The new model costs more than Google’s other AI offerings or competing models from OpenAI and DeepSeek, but remains cheaper than Anthropic’s Claude 3.7 Sonnet and OpenAI’s GPT-4.5. Developers responded positively to the pricing, marking an industry trend of increasing costs for flagship models. Google CEO Sundar Pichai says Gemini 2.5 Pro has quickly become the company’s most in-demand AI model, driving an 80 percent increase in usage across Google’s AI platforms this month. ( Google and TechCrunch )\nMicrosoft adds memory and personalization features to Copilot\nMicrosoft announced a major update to its Copilot AI assistant, introducing a “Memory” feature that allows the system to remember user preferences, interests, and personal details. Microsoft also unveiled several new capabilities including Actions (which can complete tasks like booking reservations), Copilot Vision for mobile devices, Pages for content organization, AI-generated podcasts, shopping features, and its own implementation of Deep Research. Microsoft emphasized that users maintain control over what information Copilot remembers and can opt out of memory features entirely. ( Microsoft )\nMidjourney updates image generator with new Draft Mode\nMidjourney launched V7, a completely rebuilt version of its AI image generator, now available in alpha to all paid users on monthly or annual subscription plans that range from $8 to $120 per month. The new model significantly improves image consistency for hands, body parts, and objects while delivering more realistic textures for materials like skin wrinkles and ceramics, two areas that typically reveal limitations of AI-generated images. Midjourney V7 adds three new workflow modes: Draft Mode for rapid iteration at 10x speed and half the standard GPU time cost, Turbo Mode for faster final renders at double the standard price, and Relax Mode for slower generations at half price. The update comes as Midjourney faces multiple copyright lawsuits over its training practices, but the company maintains its position as one of the most widely used art generators for social media and video production. ( Ars Technica and Midjourney )\nDevin relaunches its coding assistant with a major price drop\nCognition AI released Devin 2.0, an agentic IDE application that allows users to run multiple AI coding assistants simultaneously. The updated system features Interactive Planning, which automatically analyzes codebases and plans developer tasks, Devin Search for exploring code repositories, and Devin Wiki for automatic documentation generation. The company claims Devin 2.0 completes 83 percent more junior-level development tasks compared to its predecessor. But Devin now enters an increasingly crowded market where many competitors offer free tiers. Cognition significantly reduced subscription pricing to $20 per month (down from the previous $500), positioning the product more competitively against rivals like Cursor, GitHub Copilot, Windsurf, and AWS Developer Q. ( Cognition )\nGoogle introduces specialized cybersecurity model\nGoogle announced Sec-Gemini v1, an experimental AI model designed specifically for cybersecurity applications. The model combines Gemini’s reasoning capabilities with near real-time cybersecurity knowledge and tooling to help security professionals analyze incidents, assess threats, and understand vulnerability impacts. Sec-Gemini v1 outperforms other models on key cybersecurity benchmarks, scoring at least 11 percent higher on the CTI-MCQ threat intelligence benchmark and 10.5 percent better on the CTI-Root Cause Mapping benchmark than leading (albeit nonspecialized) OpenAI and Anthropic models. Google is making Sec-Gemini v1 freely available to select organizations, institutions, professionals, and NGOs for research purposes, as developers emphasized that advancing AI cybersecurity requires strong collaboration across the security community. ( Google )\nStill want to know more about what matters in AI right now?\nRead last week’s issue of The Batch for in-depth analysis of news and research.\nLast week, Andrew Ng shared his approach to “lazy prompting”—a technique where you start with minimal extra input and refine only as needed.\n“Laziness is a good technique only when you’ve learned how to provide enough context, and then deliberately step back to see how little context you can get away with and still have it work.”\nRead Andrew’s full letter here .\nOther top AI news and research stories we covered in depth: MoshiVis introduced interactive voice-to-voice conversations enhanced with image understanding; Cloudflare unveiled an AI-powered defense system called Labyrinth that thwarts web scrapers using decoy pages; new studies revealed that while ChatGPT may help reduce feelings of loneliness , it can also lead to emotional dependence; and Stanford researchers developed a method to animate 3D interactions between humans and objects using generated video, eliminating the need for motion capture.\nSubscribe to Data Points\n\n\n",
  "image_filename": "metas-got-a-brand-new-herd.png"
}