{
  "title": "Meta Withholds Models From Europe",
  "url": "https://www.deeplearning.ai/the-batch/meta-restricts-multimodal-models-in-the-european-union-due-to-privacy-concerns/",
  "text": "European users won’t have access to Meta’s multimodal models.\nWhat’s new: Meta said it would withhold future multimodal models from the European Union (EU) to avoid being charged, banned, or fined for running afoul of the region’s privacy laws, according to Axios. (The newly released Llama 3.1 family, which processes text only, will be available to EU users.) How it works: EU data regulators have said that Meta may be violating EU privacy laws by training models on data from Facebook, Instagram, and its other properties. Meta’s move in Europe follows its withdrawal of generative models from Brazil, after that country’s national data-protection authority struck down the part of Meta’s privacy policy that allowed it to use personal data from users of Meta products to train AI models.\nEU companies will not be able to build applications on future multimodal models from Meta. Companies outside the EU that build products based on these models will not be able to deliver them to EU customers. Text-only versions including Llama 3.1, as well as applications built on them, will continue to be available in the EU.\nIn a blog post in May, Meta announced that it would train models on text and images that are publicly visible on Meta-owned services; for example, public Facebook posts and public Instagram photos and their captions. The data-protection authorities of 11 EU member states (including Ireland, where Meta’s European headquarters is located), objected to Meta’s collection of this data from EU users. Meta responded by delaying its collection of user data in the EU.\nThe UK has a nearly identical data-protection law, but Meta does not plan to restrict its models there. That’s because UK regulators have been clearer than their EU counterparts about the law’s requirements, a Meta representative told Axios.\nApple and OpenAI in Europe: Meta is not the only global AI company that’s wary of EU technology regulations.\nIn June, Apple announced it would withhold generative AI features from iOS devices in the EU. Apple said the EU’s Digital Markets Act , which requires that basic applications like web browsers, search engines, and messaging be able to work together regardless of the operating systems they run on, prevented it from deploying the features to EU customers without compromising user privacy.\nEarly in the year, OpenAI drew attention from Italian regulators, who briefly banned ChatGPT in 2023 for violating EU law. As of May, a multinational task force was investigating the matter.\nWhy it matters: Different regions are taking different paths toward regulating AI. The EU is more restrictive than others, creating barriers to AI companies that develop new technology and products. Meta and Apple are taking proactive steps to reduce their risks even if it means foregoing portions of the European market.\nWe’re thinking: We hope regulators everywhere will think hard about how to strike a balance between protecting innovation and other interests. In this instance, the EU’s regulations have prompted Meta to make a decision that likely likely set back European AI while delivering little benefit to citizens.\n\n\n",
  "image_filename": "meta-restricts-multimodal-models-in-the-european-union-due-to-privacy-concerns.jpg"
}