{
  "title": "GenAI Violated Copyright? No Problem",
  "url": "https://www.deeplearning.ai/the-batch/microsoft-commits-to-cover-copyright-violation-costs-for-genai-services/",
  "text": "Microsoft promised to shield users of its generative AI services against the potential risk of copyright infringement.\nWhat’s new: Microsoft said it would cover the cost for any copyright violations that may arise from use of its Copilot features, which generate text, images, code, and other media within its productivity apps.\nHow it works: In its Copilot Copyright Commitment, Microsoft vows to defend customers in court against allegations that they infringed copyrights by using Microsoft software. It also promises to reimburse the cost of adverse judgments or settlements.\nThe commitment covers media created using Microsoft 365 Copilot , which generates text, images, and layouts for Word, Excel, PowerPoint, Outlook, and Teams. It also covers the output of Bing Chat Enterprise (but not the AI-enhanced search engine’s free version), and the GitHub Copilot code generator.\nCustomers are covered unless they try to breach guardrails such as filters designed to detect and block infringing output.\nMicrosoft’s commitment follows a similar promise issued in June by Adobe to indemnify users of its Firefly generative service against intellectual property claims.\nBehind the news: Microsoft, its subsidiary GitHub, and its partner OpenAI are currently defending themselves against allegations that GitHub Copilot violated copyright laws. Programmer and attorney Matthew Butterick claims that OpenAI trained GitHub Copilot in violation of open-source licenses and that the system reproduces copyrighted code without authorization. In May, a judge rejected a request by the defendants to dismiss the case, which remains ongoing.\nWhy it matters: Generative AI represents a huge business opportunity for Microsoft and others. Yet the technology is under attack by copyright holders, creating the potential that customers may face lawsuits simply for using it. That may be persuading enterprise customers — Microsoft’s bread and butter — to avoid generative AI. The company’s promise to protect them from legal action is a bold bet that the cost of defending customers will be far less than the profit it gains from selling generative products and services. We’re thinking: It’s not yet clear whether using or developing generative AI violates anyone’s copyright, and it will take time for courts and lawmakers to provide a clear answer. While legal uncertainties remain, Microsoft’s commitment is an encouraging step for companies that would like to take advantage of the technology and a major vote of confidence in the business potential of generative AI.\n\n\n",
  "image_filename": "microsoft-commits-to-cover-copyright-violation-costs-for-genai-services.png"
}