{
  "title": "More Autonomy for Martian Drone",
  "url": "https://www.deeplearning.ai/the-batch/more-autonomy-for-martian-drone/",
  "text": "The United States space agency is upgrading the system that pilots its helicopter on the Red Planet. What’s new: The National Aeronautics and Space Administration (NASA) announced that Ingenuity, a drone sent to Mars as part of its 2020 mission to Mars, will receive a new collision-avoidance algorithm, Wired reported . Ingenuity acts as a scout for the Perseverance rover as it travels from relatively flat, featureless areas to more hazardous terrain. How it works: NASA engineers on Earth plot waypoints in a simulation. They transmit the waypoints to the rover, which relays them to the drone, where algorithms determine its path based on input from an onboard camera, altimeter, and other devices.\nAn inertial measurement unit — a collection of gyroscopes and accelerometers — estimates the drone’s orientation and position during the first few seconds of flight, when dust kicked up by the rotors obscures its camera.\nWhen the camera can see the ground, a learning algorithm detects features in the image and classifies them as stationary or moving.\nA navigation algorithm tracks the craft’s location and velocity based on the stationary objects in view as well as its orientation and altitude.\nEngineers plan to upgrade Ingenuity with an algorithm that will detect hazards on the ground as it lands. The new software will equip the flyer to navigate an ancient river delta studded with cliffs, boulders, and sand traps.\nBehind the news: Ingenuity was designed for only five flights, but has flown 29 times since its debut in April 2021. NASA hopes to extend its lifespan even further by letting it hibernate through the Martian winter. Solar energy is scarce for four months starting in July, and hibernation will enable the craft to devote its battery to keeping its electronics warm. The team plans to install the upgrade during that period. Why it matters: Ingenuity’s evolving combination of Earthbound direction and local autonomy lays the groundwork for missions deeper into the solar system, where the delay in communications — up to 24 minutes between Earth and Mars — will be even longer. For example, the Dragonfly octocopter is scheduled to take off for Titan’s soupy atmosphere in 2027. We’re thinking: Over-the-air software updates aren’t only for terrestrial devices!\n\n\n",
  "image_filename": "more-autonomy-for-martian-drone.gif"
}