{
  "title": "Inferring Talent",
  "url": "https://www.deeplearning.ai/the-batch/nlp-tools-for-technical-recruiters/",
  "text": "What do your GitHub projects reveal about your professional prospects? A new model aims to help recruiters find out. What’s new: Prog.ai analyzes GitHub repositories to help employers find engineers skilled in particular areas, TechCrunch reported . The beta-test version is available by invitation only, but recruiters can join a waitlist for forthcoming free, professional, and enterprise service tiers. How it works: The company fine-tuned OpenAI’s GPT-3 on GitHub projects, LinkedIn resumes, and StackOverflow articles to evaluate prospective recruits.\nThe model copies millions of GitHub repositories and branches. It analyzes each commit and inspects code snippets, file paths, and subjects.\nIt examines the code and evaluates pull requests, rejections, and so on to infer the participants’ roles, noting core architects, frontend and backend developers, UI/UX developers, QA and test engineers, and technical writers.\nThe system matches participants’ GitHub profiles with their LinkedIn pages to align their projects and employment histories.\nRecruiters can search according to characteristics like area of expertise, years of experience, programming languages, and skills. They can reach out to prospects via an integrated contact manager.\nProg.ai says it complies with European data privacy laws. Developers can opt out of being contacted by recruiters, edit their profiles, or delete their profiles.\nBehind the news: Machine learning is already involved in hiring at many companies. 63 percent of employers and 99 percent of Fortune 500 corporations in the U.S., UK, and Germany used automated systems to screen resumes and cover letters, according to a 2021 study by Accenture and Harvard Business School. However, some hiring systems have been shown to exhibit bias . A forthcoming European Union law aims to regulate certain types of algorithms, including those that control hiring. Why it matters: Spotting the right talent for a particular position is hard, and getting harder as technical skills proliferate worldwide. If AI can do it efficiently, it may help fill open positions more effectively and distribute opportunities more evenly among the global pool of applicants.\nWe’re thinking: While building a portfolio of projects that reflect your skills and interests can help you get an interview, winning the job often comes down to soft skills like interviewing. To learn more, download our free ebook, How to Build Your Career in AI .\n\n\n",
  "image_filename": "nlp-tools-for-technical-recruiters.gif"
}