{
  "title": "Nvidia announces Cosmos world models at CES",
  "url": "https://www.deeplearning.ai/the-batch/nvidia-announces-cosmos-world-models-at-ces/",
  "text": "Twice a week, Data Points brings you the latest AI news, tools, models, and research in brief. In today’s edition, you’ll find:\nAI careers remain just as hot as you might expect\nColumbia’s GET model predicts gene expression\nCohere’s North brings easy and secure automaton to enterprise\nMeta pauses older AI characters but will introduce new ones this year\nBut first:\nNvidia unveils Cosmos platform for physical AI development\nNvidia introduced Cosmos, a platform featuring generative world foundation models and tools to accelerate the development of physical AI systems like autonomous vehicles and robots. The platform offers open model licenses, allowing developers to customize models, generate synthetic data for training and evaluation, and access advanced tokenization and data processing capabilities. Leading companies in robotics, automotive, and transportation industries, including Uber and other autonomous driving companies, are among the first to adopt Cosmos for various applications. ( Nvidia )\nMicrosoft releases Phi-4 model as open source project\nMicrosoft made its Phi-4 AI model fully open source, releasing the model weights on Hugging Face under an MIT license. The 14-billion-parameter model outperforms larger counterparts in areas like mathematical reasoning and multitask language understanding while requiring fewer computational resources. This release enables researchers and developers to freely experiment with and deploy Phi-4, a smaller model especially useful in resource-constrained environments. ( Hugging Face )\nAI jobs surge to top of LinkedIn’s fastest-growing careers list\nLinkedIn’s Economic Graph team examined job data from January 2022 to July 2024, revealing AI-related roles as the fastest-growing careers. The analysis, which required job titles to show positive growth and reach a meaningful size, placed Artificial Intelligence Engineer and AI Consultant at the top (one and two respectively), with AI Researcher ranking twelfth. This trend underscores the increasing demand for AI expertise across industries and highlights the field’s rapid expansion in the job market. ( LinkedIn )\nNew research tool decodes gene expression, paving way for targeted therapies\nScientists at Columbia University developed an AI algorithm called General Expression Transformer (GET) that predicts how genes influence cell behavior. The model, trained similarly to language programs like ChatGPT, learned the complex rules governing gene expression — the process that determines which proteins are produced in cells and in what quantities. This breakthrough could significantly enhance our understanding of cancer and genetic diseases, potentially leading to the development of cell-specific gene therapies. ( Nature and The Washington Post )\nNew enterprise product from Cohere combines LLMs, search, and automation\nCohere announced an early access preview of North, an all-in-one AI workspace that integrates large language models, search capabilities, and automation tools. The platform allows employees to create custom AI agents for tasks across various business functions, outperforming similar offerings from Microsoft and Google in accuracy benchmarks. North’s emphasis on security, customization, and seamless integration with existing workflows could accelerate AI adoption in enterprises, particularly in industries with strict data privacy requirements. ( Cohere )\nMeta plans to integrate AI characters across its social platforms\nMeta hopes to introduce AI-generated characters across its social media platforms, with the goal of boosting engagement with its three billion users. Connor Hayes, Meta’s vice president of product for generative AI, envisions these AI entities existing alongside human accounts, complete with bios, profile pictures, and the ability to generate and share AI-powered content. The company has already launched an AI character creation tool in the U.S., with plans for expansion, and is exploring ways to make interactions with AI more social. Following this announcement (and after a public backlash), Meta deleted profiles for some of its older AI characters first introduced in 2023, but still plans to move forward with new and updated characters sometime this year. ( Financial Times , NBC News , and 404 Media )\nStill want to know more about what matters in AI right now?\nRead this week’s issue of The Batch for in-depth analysis of news and research.\nThis week, Andrew Ng shared his preferred software stack and best practices for prototyping simple web apps, emphasizing the importance of being opinionated about the stack to speed up development.\n“The software stack I personally use changes every few weeks. There are many good alternatives to these choices, and if you pick a preferred software stack and become familiar with its components, you’ll be able to develop more quickly.”\nRead Andrew’s full letter here .\nOther top AI news and research stories we covered in depth: Anthropic revealed user interaction insights with Claude 3.5; researchers exposed deceptive behaviors in AI models misusing tools ; Harvard introduced a million-book corpus to boost AI training capabilities; and a new method, Localize-and-Stitch , improved performance by merging and fine-tuning multiple models.\nSubscribe to Data Points\n\n\n",
  "image_filename": "nvidia-announces-cosmos-world-models-at-ces.jpg"
}