{
  "title": "Probing Junk DNA",
  "url": "https://www.deeplearning.ai/the-batch/probing-junk-dna/",
  "text": "Deep learning helped geneticists find mutations associated with autism in vast regions of the human genome commonly known as junk DNA.\nWhat’s new: Researchers examined DNA of people with autism. They used a neural network to find mutations in noncoding regions; that is, sequences that don’t hold instructions for producing particular proteins, but regulate how proteins interact. It’s the first time noncoding DNA has been implicated in the condition.\nHow they did it: Researcher Jian Zhou and his colleagues at Princeton and elsewhere analyzed the genomes of 1,790 families.\nIn each family, autism was limited to one child, indicating that the condition was not inherited but caused by random mutation.\nA neural network scanned the genome to predict which DNA sequences affect protein interactions that are known to regulate gene expression. It also predicted whether a mutation in those sequences could interfere with such interactions.\nThe team compared the impact of mutations in autistic individuals with that of the mutations in their unaffected siblings, finding that the autistic individuals had a greater burden of high-impact mutations.\nThe team found that these high-impact mutations influence brain function.\nThey tested the predicted effect of these mutations in cells and found the gene expression was altered as predicted.\nThe work was published in Nature Genetics .\nWhy it matters: Although the results didn’t reveal the causes of autism, they did point to mutations in noncoding DNA associated with the condition. That information could lead to a better understanding of causes, and it could help scientists differentiate various types of autism. Moreover, the same approach could be applied to any disease, illuminating the role of noncoding DNA in heart diseases and neurological conditions where, like autism, direct genetic causes haven’t been identified.\nWe’re thinking: The human genome is immense and complex, and traditional lab-based approaches are too slow and cumbersome to decipher the activities of its 3 billion DNA base pairs. AI can narrow the search space, and Zhou’s work shows a hint of its potential.\n\n\n",
  "image_filename": "probing-junk-dna.png"
}