{
  "title": "Prompting DALL·E for Fun and Profit",
  "url": "https://www.deeplearning.ai/the-batch/prompting-dall-e-for-fun-and-profit/",
  "text": "An online marketplace enables people to buy text prompts designed to produce consistent output from the new generation of text-to-image generators.\nWhat’s new: PromptBase is a virtual marketplace for bespoke text strings designed as input for programs like DALL·E 2 , Midjourney , and Stable Diffusion , The Verge reported .\nHow it works: Buyers can browse PromptBase by specifying the desired system, searching categories such as “jewelry” or “wallpaper,” or typing in keywords. They can click to purchase the prompt via credit card or Google Pay. The site, which launched in June, has 50,000 active monthly users.\nSellers upload a prompt, a general description of its output, the target model, and example images. Bracketed portions of the prompt indicate ways the buyer can customize the output.\nPromptBase assesses the quality of uploaded prompts by running them through the target model and performing a reverse image search to weed out submitted images that weren’t generated from the prompt, founder Ben Stokes told The Batch . The site rejects offensive prompts and those that are too specific and lack real-world utility, such as “Homer Simpson on the beach in watercolor.” Sellers retain all rights to accepted prompts.\nThe price per prompt ranges from $1.99 to $4.99. PromptBase takes 20 percent of the revenue from each transaction.\nWhat they’re saying: “Every word in a prompt has a weight associated with it, so trying to work out what works best and where becomes a core asset in the skillset,” prompt engineer Justin Reckling, told The Verge .\nBehind the News: Designer and illustrator Guy Parsons offers The DALL·E 2 Prompt Book , a compendium of tips for producing effective prompts for text-to-image generators. The book offers several pages of tips including words that describe specific art styles, materials, compositional structures, colors, and emotions, as well as words that can influence photorealistic output such as camera angles, settings, lenses, lighting, film stocks, and so on. Moreover, research published last year investigates the relationship between prompt structure, model parameters, and text-to-image output. The work presents a number of helpful guidelines such as, “Keep the focus on keywords rather than rephrasings.”\nWhy it matters: AI-driven media generators are opening a universe of productivity in imagery, text, and music. Marketplaces for effective prompts can supercharge these already-powerful tools by cutting the time it takes to generate desirable output. They can also serve as training grounds for the emerging discipline of prompt engineering : the craft of addressing generative models in ways that yield precise, repeatable output.\nWe’re thinking: While they may not immediately replace professional illustrators — many generated images require touching up for professional purposes — image generators are becoming a staple tool of artists and graphic designers and seem likely to put many of them out of work. We hope that prompt engineering can provide an alternative livelihood for some.\n\n\n",
  "image_filename": "prompting-dall-e-for-fun-and-profit.gif"
}