{
  "title": "Retailers Spend on Smarter Stores",
  "url": "https://www.deeplearning.ai/the-batch/retailers-spend-on-smarter-stores/",
  "text": "Retailers are expected to more than triple their outlay for AI over the next few years.\nWhat’s new: A new report from Juniper Research estimates that global retailers will spend $12 billion on AI services by 2023, up from $3.6 billion in 2019. More than 325,000 shopkeepers will adopt AI over that period, mostly in China, the Far East, North America, and West Europe.\nWhy it’s happening: AI-driven tools are fueling a race among retailers in which early movers will displace competitors, the report says. Three major AI applications are enabling retailers to cut costs, optimize prices, and offer superior service:\nDemand forecasting ($760 million in 2019, $3 billion in 2023) is helping stores stay on top of consumer preferences to optimize inventory and boost sales. Juniper expects the number of retailers using AI-enabled demand forecasting tools to triple by 2023. For instance, Walmart’s pilot store uses computer vision to help employees keep shelves stocked and perishables fresh.\nSmart checkout ($253 million in sales last year, $45 billion in 2023) promises frictionless transactions, but it will take two to three years to settle in. Amazon has opened cashierless stores across Chicago, New York, San Francisco, and Seattle. Walmart's Sam’s Club and 7-11 also are experimenting with this approach.\nChatbots ($7.3 billion in sales this year, $112 billion in 2023) provide a personalized shopping experience to boost customer retention while cutting costs. For instance, Octane, a bot based on Facebook Messenger, claims to reach 90 percent of customers who have abandoned their online shopping carts, closing sales with 10 percent of them.\nTo be sure: Sales driven by chatbots likely will come at the expense of other channels, so they may not generate additional revenue. However, they will be more efficient, contributing to return on investment.\nBottom line: Retailers are banking on AI to revolutionize their industry. While they’ve focused for years on ecommerce, AI has the potential to revitalize in-store sales while spurring mobile and other channels.\n\n\n",
  "image_filename": "retailers-spend-on-smarter-stores.png"
}