{
  "title": "Reza Zadeh",
  "url": "https://www.deeplearning.ai/the-batch/reza-zadeh-active-learning-takes-off/",
  "text": "As we enter the new year, there is a growing hope that the recent explosion of generative AI will bring significant progress in active learning . This technique, which enables machine learning systems to generate their own training examples and request them to be labeled, contrasts with most other forms of machine learning, in which an algorithm is given a fixed set of examples and usually learns from those alone.\nActive learning can enable machine learning systems to:\nAdapt to changing conditions\nLearn from fewer labels\nKeep humans in the loop for the most valuable/difficult examples\nAchieve higher performance\nThe idea of active learning has been in the community for decades, but it has never really taken off. Previously, it was very hard for a learning algorithm to generate images or sentences that were simultaneously realistic enough for a human to evaluate and useful to advance a learning algorithm.\nBut with recent advances in generative AI for images and text, active learning is primed for a major breakthrough. Now, when a learning algorithm is unsure of the correct label for some part of its encoding space, it can actively generate data from that section to get input from a human.\nActive learning has the potential to revolutionize the way we approach machine learning, as it allows systems to continuously improve and adapt over time. Rather than relying on a fixed set of labeled data, an active learning system can seek out new information and examples that will help it better understand the problem it is trying to solve. This can lead to more accurate and effective machine learning models, and it could reduce the need for large amounts of labeled data.\nI have a great deal of hope and excitement that active learning will build upon the recent advances in generative AI. As we enter the new year, we are likely to see more machine learning systems that implement active learning techniques, and it is possible that 2023 could be the year that active learning truly takes off.\nReza Zadeh is founder and CEO at Matroid, a computer vision company, an adjunct professor at Stanford, and an early member of Databricks. Twitter: @Reza_Zadeh .\n\n\n",
  "image_filename": "reza-zadeh-active-learning-takes-off.png"
}