{
  "title": "Robots to the Rescue",
  "url": "https://www.deeplearning.ai/the-batch/robots-to-the-rescue/",
  "text": "Humanoid robots are notoriously ungainly, but nimble machines of roughly human size and shape could prove critical in disaster areas, where danger is high but architecture, controls, and tools are designed for homo sapiens . A new control system could help them move more nimbly through difficult environments.\nWhat’s new: Researchers at MIT are working on a two-part system. A humanoid robot called Hermes is lightweight but strong, with a shatter-resistant, carbon-fiber skeleton and high-torque actuators. The other part is an interactive control system that not only lets the operator move the robot, but lets the robot move the operator, according to IEEE Spectrum .\nHow it works: Hermes has some autonomy, but the telerobotic system is responsible for its gross movement. The key is a feedback loop between operator and robot that’s refreshed 1,000 times per second:\nThe operator stands on a platform that measures surface forces and transmits them to the Hermes.\nThe operator’s limbs and waist likewise are linked to the robot.\nMotors at some linkages apply haptic forces and torques to the operator’s body.\nSo when Hermes, say, loses its balance, the control system shoves the operator, who is forced to compensate and thus right the robot.\nGoggles track the operator’s eyes. When the operator fixes his or her gaze — a sign of mental concentration — the robot’s autonomy kicks in to lighten the cognitive load.\nBehind the news: In the 2011 nuclear meltdown at Fukushima Daiichi, high radiation levels impeded workers from taking action. That event dramatized the urgent need for robots that can respond to disasters. Not all disaster-response bots must have humanoid form, but it helps in tasks like swinging an axe, operating a fire extinguisher, and throwing switches — tasks Hermes is designed to handle.\nWhat’s next: Hermes suffers somewhat from latency in the feedback system. The researchers are looking to 5G cellular tech to make the system more responsive.\n\n\n",
  "image_filename": "robots-to-the-rescue.png"
}