{
  "title": "Robots on the High Seas",
  "url": "https://www.deeplearning.ai/the-batch/robots-on-the-high-seas/",
  "text": "An autonomous U.S. Navy warship prototype is the first crew-less vessel to make an ocean crossing.\nWhat’s happening: Sea Hunter last fall completed a round trip between its San Diego port and Pearl Harbor, Hawaii, as reported by Fortune . On the return voyage, the craft spent ten days at sea with no input from human navigators or mechanics.\nHow it works: Sea Hunter's main functions are to clear mines, track submarines, and securely relay communications. The vessel is 132 feet long and moves at around 37 miles per hour. Its software allows it not only to navigate across featureless expanses of water, but also to assess other craft and observe conventional protocols for ship-to-ship encounters.\nThe challenge: Navigating the open ocean autonomously involves a number of difficult, high-stakes tasks:\nObject recognition: Large ships are less maneuverable than cars. They need to know what’s coming from a distance, despite dark or stormy conditions.\nMotion planning: If it recognizes an object, the vessel must infer its intent to respond appropriately. The standard rules for avoiding collisions leave plenty of opportunity for potentially devastating errors.\nLocalization: To plan a trans-ocean route, the craft must integrate data from GPS, weather forecasts, and depth maps to avoid storms and shallows.\nControl: Responding to motion algorithms involves integrating diverse mechanical systems while accounting for physics.\nWhy it matters: Built by defense contractor Leidos Holdings, the $59 million craft is an early step in the Navy’s plan to counter foreign sea power with autonomous ships. It’s also a bid to save money: Sea Hunter costs $20,000 a day to operate, compared to $700,000 a day for a destroyer deployed for similar tasks. What’s next: The Navy plans to build a dozen or more autonomous ships, though it hasn’t settled on Leidos’ design. In April, the agency put out a call for combat-ready unmanned ships up to 300 feet long. Leidos plans to compete for the contract.\n\n\n",
  "image_filename": "robots-on-the-high-seas.png"
}