{
  "title": "Robotaxis Face Headwinds",
  "url": "https://www.deeplearning.ai/the-batch/san-francisco-pushes-back-on-self-driving-cars/",
  "text": "San Francisco officials are pushing back on self-driving taxis in the city after a deluge of public complaints.\nWhat's new: In an open letter , the San Francisco Municipal Transportation Agency, the county Transportation Authority, and the mayor’s Office on Disability urged California officials to maintain current restrictions on self-driving cars until the operators meet certain conditions.\nPump the brakes: Cruise and Waymo are allowed to operate robotaxis in San Francisco only within limited areas and times of day. In December 2022, Cruise asked the California Public Utilities Commission to expand its range and hours of operation. In a letter rebutting the request, officials cited 92 incidents in which vehicles from Cruise or Waymo reportedly made unplanned stops between May 29 and December 31, 2022, disrupting other cars, public transportation, and bicycles. The authors recommended that the state maintain current restrictions until the operators meet certain conditions:\nOperators would be required to observe current restrictions until they demonstrate that they can operate without disrupting traffic for several months.\nThey would be allowed to expand their fleets only incrementally (for instance, 100 vehicles at a time) to ensure that they’re able to scale without compromising safety or operations.\nThey would be required to provide data that enables officials to evaluate the impact of unplanned stops, including the number of miles traveled per vehicle, the number of unplanned stops, and their durations.\nThis data would be available to the public. (Cruise currently shares limited data with the city and requires confidentiality.)\nThe public would have at least 30 days to review the data and respond before the city allows an operator to expand its range or schedule.\nRearview mirror: Cruise and Waymo began operating robotaxis without safety drivers in San Francisco in 2020 and 2022 respectively. The city granted them permission to charge fares in 2022. Subsequently, Cruise vehicles clogged roads after losing their connections with the company’s servers in several incidents.\nWhy it matters: Self-driving cars must share the streets safely and smoothly with other forms of traffic. The reports indicate that erratic behavior by autonomous vehicles could seriously disrupt not only conventional cars but also cyclists and public transit — groups that account for nearly half of all travelers.\nWe're thinking: We welcome calls for greater transparency around self-driving cars. Government reports on their performance tend to leave it unclear how reliable vehicles from different providers are. Transparency is essential to developing an appropriate framework for making them part of daily life.\n\n\n",
  "image_filename": "san-francisco-pushes-back-on-self-driving-cars.gif"
}