{
  "title": "Science on Steroids",
  "url": "https://www.deeplearning.ai/the-batch/science-on-steroids/",
  "text": "Science is drowning in data. Hard-won findings can sink into obscurity amid the rising tide of research. But new research shows that deep learning can serve as a net for catching knowledge. What’s new: A neural network trained by researchers at the Department of Energy’s Berkeley Laboratory found materials with special properties by parsing abstracts published between 1922 and 2018. How it works: Berkeley’s library of 3.3 million abstracts contains roughly 500,000 distinct words.\nThe researchers assigned each word a vector value in 200 dimensions, numerically describing its relatedness to every other word.\nTheir model manipulated the vectors to discover fundamental terms, concepts, and principles of materials science.\nIn the course of educating itself, the model produced a ranked list of materials that were strong candidates for having thermoelectric properties, meaning they convert heat to energy.\nThe researchers checked the predicted materials against the historical record and found that their method could shave years off the process of discovering new materials. For instance, of the neural network's top five predictions based on research published prior to 2009, one wasn’t discovered until 2012, and two others had to wait until 2018.\nWhy it matters: Pick a field of science, and you’ll find loads of research that haven’t yet been wrung for insight. Untold insights hide therein. This work “suggests that latent knowledge regarding future discoveries is to a large extent embedded in past publications,” the researchers write. Now scientists may be able to take advantage of that knowledge to make more rapid progress. Takeaway: Artificial intelligence has been touted as a way to extrapolate new discoveries from extant research. Now it’s beginning to make good on that promise. Recent experiments have shown success in physics, chemistry, astronomy, and genomics. Other computationally intensive fields — for instance medicine, economics, and climatology — are in line for breakthroughs.\n\n\n",
  "image_filename": "science-on-steroids.png"
}