{
  "title": "Neural Nets Catch Fresher Fish",
  "url": "https://www.deeplearning.ai/the-batch/shinkei-systems/",
  "text": "A robot deckhand aims to help fishing boats keep their haul fresh all the way to your table.\nWhat’s new: Shinkei Systems developed a machine that uses computer vision to slaughter fish in a way that maximizes their shelf life and flavor, TechCrunch reported . How it works: The refrigerator-sized system, which is designed to withstand heavy seas, attaches to a boat’s deck. Fishermen empty their nets into a hopper that passes individual fish through the machine one by one. Inside, computer vision guides tools to pierce the animal’s brain, sever its spine, drain its blood, and deposit it into an ice bath. The process takes between 10 to 15 seconds per fish.\nThe system identifies each fish’s species and shape, then uses this data to pinpoint where its vital organs are located. Currently it recognizes a limited number of Northern Atlantic species including striped bass, steelhead trout, and black sea bass.\nThe company developed the system in partnership with fishermen and leases it to boats in New England on a profit-sharing basis. It has also partnered with several New York restaurants.\nBehind the news: The process is modeled on a manual technique called ike jime , which typically requires a skilled practitioner, making it difficult to industrialize. Ike jime is increasingly popular among upscale seafood restaurants both within and outside Japan, where it was developed.\nWhy it matters: The fast pace aboard fishing boats leaves little time for processing the catch, so most fish are left to suffocate to death, which can take minutes to hours. This isn’t just inhumane, it results in meat that’s bruised by flopping and tainted by stress-induced hormones, leading to shorter shelf life and less appetizing flavor. This system could give fishing operations an efficient way to sell their catches more profitably while dispatching fish more humanely.\nWe’re thinking: Giving such a delicate task to a robot may seem fishy, but this application seems sure to scale.\n\n\n",
  "image_filename": "shinkei-systems.gif"
}