{
  "title": "Self-Driving Deception",
  "url": "https://www.deeplearning.ai/the-batch/tesla-allegedly-misled-the-public-about-its-self-driving/",
  "text": "Tesla, whose autonomous-vehicle technology has been implicated in a number of collisions, promoted it in a way that apparently was intended to deceive.\nWhat's new: Tesla deliberately misled the public about its vehicles’ ability to drive themselves, according to Bloomberg and other news outlets.\nHuman in the loop: In 2016, Tesla shared a video that showed a car traveling from a household driveway to an office parking lot. Onscreen text read, “The person in the driver’s seat is only there for legal reasons. He is not doing anything. The car is driving itself.”\nTesla CEO Elon Musk pushed engineers to falsify the video, according to internal emails obtained by Bloomberg . He said he would inform viewers that the video showed future, not current, capabilities. Instead, when the company published the video, Musk tweeted , “Tesla drives itself (no human input at all) thru urban streets to highway to streets, then finds a parking spot.”\nTestifying in a lawsuit over the fatal crash of a Tesla vehicle in 2018, the company’s head of Autopilot software said the video was partially staged, Reuters reported . “The intent of the video was not to accurately portray what was available for customers in 2016. It was to portray what was possible to build into the system,” he told the court.\nThe New York Times described the making of the same video in late 2021, noting that engineers had specially mapped the route ahead of time and the vehicle crashed at least once during the shoot.\nBehind the news: The United States National Highway Traffic Safety Administration (NHTSA) recently determined that a Tesla vehicle controlled by Autopilot in 2022 braked unexpectedly, leading to an eight-car pile-up. The accident occurred hours after Musk had tweeted that Autopilot was available to all North American drivers who purchased the option. (Previously it had been limited to drivers who had demonstrated safe driving.) NHTSA is investigating hundreds of complaints of Tesla vehicles braking unexpectedly.\nWhy it matters: Tech companies commonly promote capabilities well ahead of their capacity to deliver. In many cases, the biggest casualties are intangibles like the public’s trust and investors’ bank accounts. When it comes to self-driving cars, false promises can be deadly.\nWe're thinking: A company’s engineers are often the only ones who have the experience and perspective to foresee the consequences of a misleading product demo. When they do, their duty is not to keep mum but to push back.\n\n\n",
  "image_filename": "tesla-allegedly-misled-the-public-about-its-self-driving.png"
}