{
  "title": "DeepMind’s Offspring Proliferate",
  "url": "https://www.deeplearning.ai/the-batch/the-thriving-startups-founded-by-former-deepmind-employees/",
  "text": "Where spores from DeepMind scatter, startups blossom.\nWhat’s new: Nearly 200 former employees of Google’s elite AI research lab have gone on to found or join startups, Business Insider reported . Emerged from stealth: Venture capital firms are eager to fund projects that involve ex-DeepMinders, and alumni often benefit from angel investments by their former colleagues. While many such projects are in stealth mode, some have revealed themselves.\nFounded by DeepMind co-founder Mustafa Suleyman and former principal research scientist Karén Simonyan, Inflection AI builds conversational large language models such as the Pi chatbot. In June, the company announced a gigantic $1.3 billion funding round led by Microsoft and Nvidia.\nMistral , co-founded by Arthur Mensch, a former DeepMind senior research scientist, seeks to build open-source language models. It secured a $113 million seed round in June, just four weeks after it was founded.\nCo-founded by ex-DeepMind senior research engineer Jonathan Godwin , Orbital Materials builds models that help develop new materials for applications such as renewable energy and carbon capture.\nLatent Labs , started by erstwhile AlphaFold team lead Simon Kohl , plans to build generative AI tools for biology.\nBrainchild of ex-DeepMind research engineers Devang Agrawal and Adam Liska, GlyphicAI is developing chatbots for business-to-business sales teams. The startup raised $5.5 million in pre-seed funding in June.\nBehind the news: Acquired by Google in 2014, DeepMind has developed several high-profile innovations and popularized reinforcement learning. Earlier this year, it merged with Google Brain (which Andrew Ng started and formerly led).\nDeepMind established its reputation for cutting-edge research with AlphaGo, a reinforcement learning system that bested Go world champion Lee Sedol in 2016.\nIn 2018, the lab astonished the biomedical community with AlphaFold, a model that finds the structures of proteins — a capability that could lead to discovery of new medicines and other biologically active compounds. The lab spun out a startup, Isomorphic, to capitalize on the achievement.\nDeepMind also has contributed important work in AI-based fluid dynamics and energy forecasting .\nWhy it matters: Tech giants are magnets for AI talent, and top employees gain valuable practical and market experience. Yet many come to feel confined by conditions within an established company. Former DeepMinders who formed their own companies cited their desire to follow currents of deep learning, such as generative AI, that their former employer doesn’t emphasize and their need for flexibility to pursue goals that didn’t necessarily revolve around machine learning.\nWe’re thinking: While high-profile associations often attract capital and attention, great ideas can come from anywhere. They seldom happen overnight; usually, they’re the end result of a long incubation period spent honing them through experimentation and feedback. Start small and develop your intuition, skills, and credibility. That’s how pretty much everyone started who ended up having a huge impact!\n\n\n",
  "image_filename": "the-thriving-startups-founded-by-former-deepmind-employees.gif"
}