{
  "title": "The Model Will See You Now",
  "url": "https://www.deeplearning.ai/the-batch/the-model-will-see-you-now/",
  "text": "Institutional hurdles to AI for medicine began to fall, setting the stage for widespread clinical use of deep learning in medical devices and treatments. What happened: DeepMind’s AlphaFold model determined the three-dimensional shape of a protein in just hours, stealing the spotlight with promises of new blockbuster drugs and biological insights. Behind the scenes, the medical establishment took important steps to bring such technologies into mainstream medical practice. Driving the story: Institutional shifts boosted medical AI’s profile and heralded its growing acceptance.\nThe largest medical insurers in the U.S., Medicaid and Medicare, agreed to reimburse doctors who use certain devices that incorporate machine learning. VizLVO from Viz.ai alerts doctors when a patient may have suffered a stroke. IDx-DR from Digital Diagnostics recognizes signs of a diabetes-related complication that can cause blindness.\nThe U.S. Food and Drug Administration cleared several new AI-based treatments and devices, such as a system that conducts cardiac ultrasounds .\nAn international, interdisciplinary group of medical experts introduced two protocols, Spirit and Consort , designed to ensure that AI-based clinical trials follow best practices and are reported in ways that enable external reviewers to verify the results.\nWhere things stand: Many applications of AI in medicine require doctors and hospitals to reorganize their workflow, which has slowed adoption to some extent. Once they’ve cleared the FDA and Medicare, clinicians have a much greater incentive to make the changes needed to take full advantage of them.\nLearn more: Our AI For Medicine special issue features stories about deep learning in diagnosis, prognosis, and treatment, along with an exclusive interview with medical-AI godfather Eric Topol. Learn how to build your own medical models in the AI For Medicine Specialization on Coursera.\n\n\n",
  "image_filename": "the-model-will-see-you-now.jpg"
}