{
  "title": "This Snowman Does Not Exist",
  "url": "https://www.deeplearning.ai/the-batch/this-snowman-does-not-exist/",
  "text": "While generative adversarial networks were infiltrating cultural, social, and scientific spheres, they quietly transformed the web into a bottomless well of synthetic images of . . . well, you name it. What happened: Deepfakes showed up in mainstream entertainment , commercials , political campaigns , and even a documentary film in which they were used to protect onscreen witnesses. Amid the hoopla, a groundswell of online front-ends to image generators went largely unremarked. Driving the story: Inspired by 2019’s This Person Does Not Exist , a web app that produces realistic-looking personal portraits, engineers with a sense of humor implemented generative adversarial networks (GANs) that mimic real-world minutiae. Some of our favorites:\nTrained on images from Google Earth, This City Does Not Exist produces birds-eye-views of settlements large and small.\nEven non-equestrian types can appreciate This Horse Does Not Exist ’s ability to produce a wide variety of poses, breeds, and situations. Sure, it occasionally spits out a horrific jumble of limbs, but that’s half the fun.\nLike many GANs, This Pizza Does Not Exist tends to average out distinctive features. Hence, its cheeses lack a gooey sheen, its sauce is rarely vibrant, and its crusts look underbaked. But, as the adage goes, even bad pizza is still pizza.\nThe authors didn’t release a web version of This Chinese Landscape Painting Does Not Exist , but in tests, its output fooled human art aficionados around half of the time.\nWhere things stand: Some observers worry that AI-generated fakes could undermine trust in public institutions by sowing confusion over what is and isn’t real. ( Which is not to say GANs are required for that .) But the technology turns out to have a critically important use that outweighs any negative social consequences: Balancing pictures of cats on the internet with pictures of dogs .\nLearn more: The Batch ’s GAN special issue features stories about detecting deepfakes, making GANs more inclusive, and an interview with GAN inventor Ian Goodfellow. To learn how to build GANs yourself, check out the Generative Adversarial Networks Specialization on Coursera.\n\n\n",
  "image_filename": "this-snowman-does-not-exist.jpg"
}