{
  "title": "Ukraine’s Homegrown Drones",
  "url": "https://www.deeplearning.ai/the-batch/ukraines-drone-industry-takes-flight-amidst-conflict/",
  "text": "The war in Ukraine has spurred a new domestic industry.\nWhat’s new: Hundreds of drone companies have sprung up in Ukraine since Russian forces invaded the country early last year, The Washington Post reported .\nHow it works: Ukrainian drone startups are developing air- and sea-borne robots, which the country’s military use to monitor enemy positions, guide artillery strikes, and drop bombs, sometimes on Russian territory.\nQuadcopters built by Twist Robotics use AI-powered target tracking to remain locked onto targets even if the operator loses radio contact. Air and naval drones from Warbirds have similar capabilities.\nWorking in an active war zone gives local drone makers advantages over their foreign counterparts. For instance, Ukrainian authorities give domestic firms access to captured Russian jamming technology so that they can develop countermeasures. Similarly, the companies acquire huge amounts of real-world data from the front lines, such as images of tanks or landmines in a variety of settings, that can be used to train their systems. They also receive immediate feedback on how their machines perform on the battlefield.\nForeign companies are angling to get involved — partly to gain access to the same data. Canada-based Draganfly and U.S.-based BRINC are actively developing drones in Ukraine. German defense-AI company Helsing and U.S. data analytics firm Palantir also maintain offices there.\nRussia responds: In recent months, Russia has stepped up attacks by Russian-made Lancet fliers that explode upon crashing into their targets. Recent units appear to contain Nvidia Jetson TX2 computers, which could drive AI-powered guidance or targeting, Forbes reported . Russian state news denied that its drones use AI.\nBehind the news: Other countries are also gearing up for drone warfare.\nA U.S. Navy group called Task Force 59 recently tested a system, built from off-the-shelf components, that identifies threats based on data from drones, other air vessels, surface ships, and submarines.\nThe Israel Defense Forces reportedly deployed an AI system that selects targets for air strikes. A separate system then calculates munition loads, schedules strikes, and assigns targets to drones and crewed aircraft.\nTaiwan launched a major program to build its own drones.\nWhy it matters: Drones rapidly have become a battlefield staple, and their offensive capabilities are growing. Governments around the world are paying close attention for lessons to be learned — as are, no doubt, insurgent forces, paramilitary groups, and drug cartels. We’re thinking: We stand with the brave Ukrainian soldiers as they defend their country against an adversary with a much larger air force. War is tragic and ugly. We wish that no one used AI-enabled weapons. But the reality is that peaceful and democratic nations do, if only to defend themselves against adversaries who do the same. We are heartened by recent agreements to limit development of fully autonomous weapons, and we support the United Nations’ proposal to ban them entirely.\n\n\n",
  "image_filename": "ukraines-drone-industry-takes-flight-amidst-conflict.png"
}