{
  "title": "Ukraine Develops Aquatic Drones",
  "url": "https://www.deeplearning.ai/the-batch/ukraines-naval-drones-shift-balance-in-black-sea-war-against-russia/",
  "text": "Buoyed by its military success developing unmanned aerial vehicles, Ukraine is building armed naval drones.\nWhat’s new: A fleet of robotic watercraft has shifted the balance of naval power in Ukraine’s ongoing war against Russia in the Black Sea, IEEE Spectrum reported .\nHow it works: Ukraine began building seafaring drones to fight a Russian blockade of the Black Sea coast after losing most of its traditional naval vessels in 2022. The Security Service of Ukraine, a government intelligence and law enforcement agency, first cobbled together prototypes from off-the-shelf parts. It began building more sophisticated versions as the home-grown aerial drone industry took off.\nMagura-v5 , a surface vessel, is 18 feet long and 5 feet wide and has a range of around 515 miles at a cruising speed of 25 miles per hour. A group of three to five Maguras, each carrying a warhead roughly as powerful as a torpedo, can surround target vessels autonomously. Human operators can detonate the units from a laptop-size console.\nSea Baby is a larger surface vessel that likely shares Magura-v5’s autonomous navigation capabilities, but its warhead is more than twice as powerful. It’s roughly 20 feet long and 6.5 feet wide with a range of 60 miles and maximum speed of 55 miles per hour.\nMarichka is an uncrewed underwater vessel around 20 feet long and 3 feet wide with a range of 620 miles. Its navigational capabilities are unknown. Observers speculate that, like the surface models, Marichka is intended to locate enemy vessels automatically and detonate upon a manual command.\nDrone warfare: Ukraine’s use of aquatic drones has changed the course of the war in the Black Sea, reopening key shipping routes. Ukraine has disabled about a third of the Russian navy in the region and pushed it into places that are more difficult for the sea drones to reach. Russia has also been forced to protect fixed targets like bridges from drone attacks by fortifying them with guns and jamming GPS and Starlink satellite signals.\nBehind the news: More-powerful countries are paying attention to Ukraine’s use of sea drones. In 2022, the United States Navy established a group called Uncrewed Surface Vessel Division One , which focuses on deploying both large autonomous vessels and smaller, nimbler drones. Meanwhile, China has developed large autonomous vessels that can serve as bases for large fleets of drones that travel both above and under water.\nWhy it matters: While the U.S. has experimented with large autonomous warships , smaller drones open different tactical and strategic opportunities. While larger vessels generally must adhere to established sea routes (and steer clear of shipping vessels), smaller vessels can navigate more freely and can make up in numbers and versatility what they lack in firepower. We’re thinking: We support Ukraine’s right to defend itself against unwarranted aggression, and we’re glad the decision to detonate its aquatic drones remains in human hands. We hope the innovations spurred by this conflict will find beneficial applications once the war is over.\n\n\n",
  "image_filename": "ukraines-naval-drones-shift-balance-in-black-sea-war-against-russia.gif"
}