{
  "title": "Don't Worry About Math. Master It!",
  "url": "https://www.deeplearning.ai/the-batch/unlock-the-power-of-machine-learning-by-learning-the-math-that-make-them-work/",
  "text": "Dear friends,\nToday DeepLearning.AI is launching the Mathematics for Machine Learning and Data Science Specialization , taught by the world-class AI educator Luis Serrano. In my courses, when it came to math, I’ve sometimes said, “Don’t worry about it.” So why are we offering courses on that very subject?\nYou can learn, build, and use machine learning successfully without a deep understanding of the underlying math. So when you’re learning about an algorithm and come across a tricky mathematical concept, it’s often okay to not worry about it in the moment and keep moving. I would hate to see anyone interrupt their progress for weeks or months to study math before returning to machine learning (assuming that mastering machine learning, rather than math, is your goal).\nBut . . . understanding the math behind machine learning algorithms improves your ability to debug algorithms when they aren’t working, tune them so they work better, and perhaps even invent new ones. You’ll have a better sense for when you’re moving in the right direction or something might be off, saving months of effort on a project. So during your AI journey, it’s worthwhile to learn the most relevant pieces of math, too. If you’re worried about your ability to learn math, maybe you simply haven’t yet come across the best way to learn it. Even if math isn’t your strong suit, I’m confident that you’ll find this specialization exciting and engaging.\nLuis is a superb machine learning engineer and teacher of math. He and I spent a lot of time debating the most important math topics for someone in AI to learn. Our conclusions are reflected in three courses:\nLinear algebra. This course will teach you how to use vectors and matrices to store and compute on data. Understanding this topic has enabled me to get my own algorithms to run more efficiently or converge better.\nCalculus. To be honest, I didn’t really understand why I needed to learn calculus when I first studied it in school. It was only as I started studying machine learning — specifically, gradient descent and other optimization algorithms — that I appreciated how useful it is. Many of the algorithms I’ve developed or tuned over the years would have been impossible without a working knowledge of calculus.\nProbability and statistics. Knowing the most common probability distributions, deriving ways to estimate parameters, applying hypothesis testing, and visualizing data all come up repeatedly in machine learning and data science projects. I’ve found that this knowledge often helps me make decisions; for instance, judging whether one approach is more promising than another.\nMath isn’t about memorizing formulas, it’s about building a conceptual understanding that sharpens your intuition. That’s why Luis, curriculum product manager Anshuman Singh, and the team that developed the courses present them using interactive visualizations and hands-on examples. Their explanations of some concepts are the most intuitive I’ve ever seen.\nI hope you enjoy the Mathematics for Machine Learning and Data Science Specialization ! Keep learning,\nAndrew\n\n\n",
  "image_filename": "unlock-the-power-of-machine-learning-by-learning-the-math-that-make-them-work.gif"
}