{
  "title": "Waymo Spotlights Safety Record",
  "url": "https://www.deeplearning.ai/the-batch/waymo-claims-its-robotaxis-are-safer-than-human-drivers-citing-new-safety-data/",
  "text": "Waymo, the autonomous vehicle division of Alphabet, released an analysis of its own safety data. It suggests that the company’s self-driving cars are safer than human drivers on the same roads.\nWhat’s new: Waymo’s analysis claims that its robotaxis, compared to human-driven vehicles, were involved in proportionally fewer accidents that involved police reports, passenger injuries, or airbag deployment. The company argues that these types of incidents are more relevant to assessing safety than minor collisions with no serious damage.\nHow it works: The study compares the number of incidents per mile experienced by Waymo vehicles and human drivers. It covers over 22 million miles driven along specific routes in Phoenix, Arizona, and San Francisco, California. The results were consistent in Phoenix and San Francisco.\nWaymo vehicles had 48 percent fewer incidents that were reported to the police than vehicles driven by humans.\nWaymo vehicles had 73 percent fewer incidents that caused injuries than vehicles driven by humans.\nWaymo vehicles deployed airbags 84 percent less frequently than vehicles driven by humans.\nBehind the news: Waymo’s study arrives amid ongoing scrutiny of autonomous vehicle safety, particularly in San Francisco, where accidents and traffic disruptions caused by self-driving cars have raised public backlash and regulatory challenges . Earlier this year, the state of California banned Cruise, a Waymo competitor, after one of its self-driving cars drove over a pedestrian and dragged her about 20 feet before coming to a stop.\nWhy it matters: Waymo’s analysis implies that autonomous vehicles could significantly reduce road accidents and injuries. The data could help urban planners to craft policies that would integrate autonomous vehicles into existing transportation systems.\nYes, but: Waymo’s analysis is based on methods and benchmarks introduced in two research papers that have not yet been peer reviewed. Validating them through peer review would help to establish the safety record of self-driving cars.\nWe’re thinking: This report makes a compelling case for autonomous vehicles. But the question remains whether these findings will be sufficient to increase public trust. We encourage other self-driving companies to release comprehensive safety data.\n\n\n",
  "image_filename": "waymo-claims-its-robotaxis-are-safer-than-human-drivers-citing-new-safety-data.gif"
}