{
  "title": "What Will Change — And What Will Stay the Same",
  "url": "https://www.deeplearning.ai/the-batch/what-will-change-and-what-will-stay-the-same/",
  "text": "Dear friends,\nAI is progressing faster than ever. This is thrilling, yet rapid change can be disorienting. In such times, it’s useful to follow Jeff Bezos’ advice to think about not only what is changing but also what will stay the same. If something doesn’t change, investing energy and effort in it is more likely to be worthwhile.\nHere are some things in AI that I’m confident won’t change over the next decade:\nWe need community. People with friends and allies do better than those without. Even as the AI world brings breakthroughs seemingly every week, you’ll be better off with friends to help sort out what’s real and what’s hype, test your ideas, offer mutual support, and build things with.\nPeople who know how to use AI tools are more productive. People and businesses that know how to manipulate data are more effective at getting at the truth, making better decisions, and accomplishing more. This will only become more true as AI continues to progress.\nAI needs good data to function well. Just as humans need good data to make decisions ranging from what marketing strategy to pursue to what to feed a child, AI need will good data even as our algorithms continue to scale, evolve, and improve.\nWhat does this mean for each of us? Taking the points above in turn:\nLet’s keep building the AI community. This is important! I hope you’ll share what you learn with others, motivate each other, and continue to find friends and collaborators. While we do our best in The Batch to cover what matters in AI, having a close group of friends to talk these things over with can deepen your knowledge and sharpen your ideas.\nKeep learning! Even better, make learning a habit. It can keep you more productive, among many other benefits. If you’re thinking about 2024 new year resolutions, include your learning goals. As AI continues to evolve, everyone needs a plan to keep up with — and in some cases even take a role in accelerating — this wave.\nContinue to cultivate data-centric AI practices. As businesses adopt more AI tools, I find that one of the most important practices is to keep control of your own data. I think this will grow in importance for individuals too. I'll say more about this in a future letter.\nWhile the three points above relate to AI, I want to share two other things that I’m confident will, unfortunately, stay the same over the next decade: (i) Climate change will continue to be a major challenge to humanity. (ii) Poverty, where many people can barely (or perhaps not even) afford basic necessities, will remain a problem. I will continue to think about how AI climate modeling can help the former and how we can use AI to lift up everyone.\nThrough this exciting time, I’m grateful to be connected to you. I look forward to navigating with you the changes — and constants — of 2024.\nHappy new year!\nAndrew\n\n\n",
  "image_filename": "what-will-change-and-what-will-stay-the-same.jpg"
}