{
  "title": "Where the Robots Will Land",
  "url": "https://www.deeplearning.ai/the-batch/where-the-robots-will-land/",
  "text": "Automatons will take 20 million manufacturing jobs globally by 2030 even as they drive substantial economic growth, according to a new study. Humans can get ahead of the curve by distributing the benefits where they’ll be needed most. What’s new: UK business analytics firm Oxford Economics issued How Robots Change the World , which the authors call an “early warning system” of coming social impacts. The report compares investment data from the International Federation of Robotics with statistics tracking employment, wages, and GDP across a number of job sectors, countries, and demographics. Industries hit: Manufacturing has seen the highest degree of automation so far. The researchers expect that trend to continue, but they also expect robots soon to begin a grand takeover of the service industry. For instance, automated vehicles will curb professional drivers from Lyft to long-haul. U.S outlook: Poor populations and rural regions that rely on manufacturing will be hit hardest:\nOregon is most vulnerable due to its high concentration of factories in the Willamette Valley near Portland.\nManufacturing hubs including Louisiana, Indiana, and Texas come next.\nStates with predominantly white collar jobs, dense urbanization, or lots of tourism are least vulnerable.\nHawaii will see the least impact, at least until someone invents a droid that can drape a garland of flowers around a person's neck.\nThe big picture: A similar pattern is expected to play out internationally:\nChina will likely accelerate its transformation into an industrial cyborg, adding up to 14 million new industrial robots.\nSouth Korea, Japan, and Europe will also add significant numbers of robot workers.\nThe bright side: The impacts won't be entirely negative:\nMore efficient markets generate more revenue, which investors pour into new ventures, generating new jobs.\nShould robotification replace 30 percent of the industrialized workforce, it will also add $5 trillion to the gross world product (currently around $88 trillion).\nThe jobs most likely to disappear are repetitive, low-skill work non-robots describe as soul-crushing. The jobs that replace them are likely to require more brainpower.\nOur take: Even if new jobs appear as quickly as old ones evaporate, the robot revolution will disrupt human lives. Some people won't take well to retraining. Others might not live where new jobs arise. Policymakers in manufacturing-heavy regions can mitigate the worst impacts by fostering industries less prone to automation — technology, communications, healthcare, finance, tourism — and providing training so people will be ready for those jobs when they come.\n\n\n",
  "image_filename": "where-the-robots-will-land.png"
}