{
  "title": "Hinton Leaves Google With Regrets",
  "url": "https://www.deeplearning.ai/the-batch/why-geoffrey-hinton-resigned-from-google/",
  "text": "A pioneer of deep learning joined the chorus of AI insiders who worry that the technology is becoming dangerous, saying that part of him regrets his life’s work.\nWhat’s new: Geoffrey Hinton, who has contributed to groundbreaking work on neural networks since the 1980s, stepped down from his role as a vice president and engineering fellow at Google so he could voice personal concerns about AI’s threat to society, The New York Times reported . He believes that Google has acted responsibly in its AI development, he added in a subsequent tweet .\nWhy he stepped down: AI models have improved faster than Hinton had expected, and the generative AI gold rush led him to believe that the financial rewards of innovating would overwhelm incentives to rein in negative effects. In addition, at 75, he has become “too old to do technical work,” he told MIT Technology Review . Instead, he will focus on philosophical matters. Among his concerns:\nGenerated media could erode the average person’s ability to gauge reality.\nAI models could cause massive unemployment by automating rote work, and perhaps not-so-rote work.\nAutomated code generators eventually could write programs that put humans at risk.\nHinton supports global regulation of AI but worries that it would be ineffective. Scientists probably can devise more effective safeguards than regulators, he said.\nBehind the news: Hinton’s contributions to deep learning are myriad. Most notably, he helped popularize the use of backpropagation, the core algorithm for training neural networks; invented the dropout technique to avoid overfitting; and led development of AlexNet, which revolutionized image classification. In 2018, he received the Turing Award alongside Yann LeCun and Yoshua Bengio for contributions to AI.\nWhy it matters: Hinton’s thoughts about AI risks are exceptionally well informed. His concerns sound a note of caution for AI practitioners to evaluate the ethical dimensions of their work and stand by their principles.\nWe’re thinking: Geoffrey Hinton first joined Google as a summer intern (!) at Google Brain when Andrew led that team. His departure marks the end of an era. We look forward to the next phase of his career.\n\n\n",
  "image_filename": "why-geoffrey-hinton-resigned-from-google.png"
}